{
  "pages": [
    {
      "imageUrl": "/comics/the-adventure-of-hami/00000001-cover.png",
      "text": {
        "en": "Cover page",
        "de": "Titelseite",
        "zh": "封面页"
      }
    },
    {
      "imageUrl": "/comics/the-adventure-of-hami/00000002-copyright.png",
      "text": {
        "en": "Copyright: 2022 Watermelon Puppet. All rights reserved.",
        "de": "Urheberrecht: 2022 Watermelon Puppet. Alle Rechte vorbehalten.",
        "zh": "版权声明：2022年，西瓜玩偶。保留所有权利。"
      }
    },
    {
      "imageUrl": "/comics/the-adventure-of-hami/00000003-chapter-0-cover.png",
      "text": {
        "en": "Chapter 0: Character Introduction",
        "de": "Kapitel 0: Charaktervorstellung",
        "zh": "第0章：登场动物介绍"
      }
    },
    {
      "imageUrl": "/comics/the-adventure-of-hami/00000004-character-intro-hami.png",
      "text": {
        "en": "Hami (pronunciation: hah-mee): the main character of our story, a hamster in light grey fur, living in a hole under a tree on the Waane Heathland. He is optimistic, playful and full of curiosity. Not like other rodents, he is brave and adventurous. He would try any kind of activity just to have fun, and investigate any sort of anomaly to satisfy his curiosity. He rarely thinks before doing, not even to mention \"think twice\". No matter what kind of an idea comes into his mind, he would try it out immediately. As a result, he is always in trouble. Luckily, each time he gets into the difficult situation, his friends would help him out. Besides, he always comes up with some weird last-minute solutions too, in addition with a little bit luck, he always manages to escape unscatched from those trouble situations.",
        "de": "Hami: die Hauptfigur des Comics, ein Hamster in hellgrauem Pelz, wohnt in einem Loch unter einem Baum auf der Waane Heide. Er ist optimistisch, verspielt und voller Neugier. Ganz anders als andere Nageltiere ist er mutig und abenteuerlich. Er würde jede Aktivität ausprobieren um Spaß zu haben, und jede Anomalie untersuchen um seine Neugier zu befriedigen. Er denkt selten, bevor er irgendwas macht, ganz zu schweigen davon, zweimal nachzudenken. Egal welche Idee zu ihm kommt, würde er sofort anfangen auszuprobieren. Daher befindet er immer in den gefährlichen Situationen. Glücklicherweise kommen seine Freunden jedesmal zu helfen. Außerdem denkt sich er auch immer ein paar komische \"last-minute\" Lösungen aus, mit ein bisschen Glück noch dazu, kann er immer von den schwerigen Situationen unberührt entziehen.",
        "zh": "哈米（Hami）：故事的主人公，是一只浅灰色的仓鼠，住在瓦纳荒原上一棵大树下面的树洞里。他非常乐天派、爱玩，并且对什么事物都充满了好奇心。不像是其他的啮齿类动物，他的胆子很大。为了玩，不管是什么他都想要试一试；为了满足他的好奇心，不管是什么响动他都想要去看个究竟。他做事情之前很少思考，更不懂得什么叫做“三思而后行”了，只要他一想到什么点子，身体就会不由自主地开始动起来去做那件事情，所以经常让自己卷入一些麻烦里。幸好，每次遇到困境，他的朋友都会来帮他的忙。而且他自己也经常临机应变想出一些奇怪的点子，再借着一点点运气，他每次总是能摆脱困境。"
      }
    },
    {
      "imageUrl": "/comics/the-adventure-of-hami/00000005-character-intro-tini.png",
      "text": {
        "en": "Tini (pronunciation: tee-nee): Hami's best friend, a tiny, golden-colored field mouse. She lives deep in a bush on Waane Heathland. Her favourite thing is picking the little flowers by the roadside and put them on her head. She is intelligent, careful, cautious, and always foresighted. Each time she and Hami get stuck in a trouble situation, she is always the one who comes up with ideas firstly. However, sometimes she could also be overcautious and perfectionistic. She has a typical rodent characteristic. Any little noise is enough to scare her away. Although Hami's adventurous characteristic always gives her a huge headache, she joins Hami in any activity, since what Hami does seems too attractive and irresistable to her. And each time when Hami get into trouble, she always tries her best to help.",
        "de": "Tini: die beste Freundin von Hami, eine winzige Waldmaus in goldem Pelz. Sie wohnt tief in einer Busch auf der Waane Heide. Was sie am liebsten macht ist die Blumen an der Seite des Pfades zu pflücken, und auf ihrem Kopf zu tragen. Sie ist intelligent, sorgfältig, vorsichtig und immer vorausschauend. Jedesmal wenn sie und Hami in den schwierigen Situationen befinden, ist sie immer die Erste, die mit den Ideen aufkommen. Jedoch könnte sie manchmal auch übervorsichtig und perfektionistisch sein. Sie ist ein typisches Nageltier. Ein kleines Geräusch ist schon genug, um sie abzuschrecken. Obwohl ihr Hamis abenteuerlicher Charakter einen großen Kopfschmerz gemacht hat, macht sie bei jeden Hamis Aktivitäten mit, denn was Hami macht ist ihr zu attraktiv und unwiderstehlich. Und jedesmal wenn Hami ein Problem hat, versucht sie immer das Beste, Hami zu helfen.",
        "zh": "提妮（Tini）：哈米的好朋友，是一只金黄色的姬鼠，身材娇小。她住在瓦纳荒原上一片灌木丛的最深处。她最喜欢做的事情就是把路边新鲜的小野花采下来戴在头上。她很聪明，非常仔细、谨慎，做事也很有预见性。每次她和哈米遇到困难的时候，她总是担当起智囊的角色。不过她也因为这样的性格特点有点谨小慎微，有的时候还会有一点完美主义。她的性格是典型的啮齿类动物的性格，只要一有什么风吹草动就会躲得远远的。虽然对哈米招麻烦的体质非常苦恼，但是每一次又因为哈米做得事情太有趣而忍不住加入哈米。而且每一次哈米陷入困境的时候，她都会想方设法地去帮他。"
      }
    },
    {
      "imageUrl": "/comics/the-adventure-of-hami/00000006-character-intro-poti.png",
      "text": {
        "en": "Poti (pronunciation: po-tee): Hami and Tini's mascot, a doll that Tini gives Hami as a gift. It is a white hamster with a little pot on its head and a sunflower seed in its hands. In theory, Poti is a gift that Tini gave Hami, to remind Hami that he shouldn't do anything stupid, and Hami should bring it with him all the time and take care of it. However, the careless and playful Hami always forgets to do this. So actually the time that Poti stays with Tini is even longer than it is with Hami.",
        "de": "Poti: das Maskottchen von Hami und Tini, eine Puppe, die Tini an Hami geschenkt hat. Er ist ein weißer Hamster mit einem kleinen Topf auf seinem Kopf, und einem Sonnenblumenkern in seinen Händen. Theoretisch ist Poti ein Geschenk von Tini an Hami, um Hami daran zu erinnern, nichts dummes zu unternehmen, und Hami sollte ihn immer mitbrigen, und sich darum kümmern. Aber der unvorsichtige und verspielte Hami vergiss es immer das zu machen. Deswegen ist die Zeit, wo Poti mit Tini bleibt, sogar länger als die mit Hami.",
        "zh": "波蒂（Poti）：哈米和提妮两只鼠的幸运吉祥物，是提妮作为礼物送给哈米的绒布玩偶。它的形象是一只顶了一口小锅的白色仓鼠，手里还捧着一颗葵花籽。名义上，它是提妮为了提醒哈米不要乱跑、不要干傻事才送给哈米的，并且要求哈米随时把它带在身边照顾好它。可是粗心的哈米总是因为贪玩而忘记带上波蒂，所以波蒂跟着提妮的时间比跟着哈米的时间还要长。"
      }
    },
    {
      "imageUrl": "/comics/the-adventure-of-hami/00000007-chapter-1-cover.png",
      "text": {
        "en": "Chapter 1: An Acorn in the Sky",
        "de": "Kapitel 1: Eine Eichel im Himmel",
        "zh": "第1章：天空中的橡子"
      }
    },
    {
      "imageUrl": "/comics/the-adventure-of-hami/00000008-a-morning-on-waane-heathland.png",
      "text": {
        "en": "Another wonderful sunny morning, the whole Waane Heathland was covered by peacefulness.",
        "de": "Wieder ein wunderschöner sonniger Morgen, die ganze Waane Heide wurde von Friedlichkeit bedeckt.",
        "zh": "又是一个美丽而又晴朗的早晨，瓦纳荒原上洋溢着一片祥和的气氛。"
      }
    },
    {
      "imageUrl": "/comics/the-adventure-of-hami/00000009-hami-is-thinking.png",
      "text": {
        "en": "Hami woke up quite early, and seemed to be planing something, which didn't look like the usual Hami at all.",
        "de": "Hami stand ziemlich früh auf, und es sah so aus, dass er gerade irgendwas plante, ganz anders als der übliche Hami.",
        "zh": "哈米早早地就起了床，似乎在计划着什么——这可一点都不像是平常的哈米。"
      }
    },
    {
      "imageUrl": "/comics/the-adventure-of-hami/00000010-poti-behind-the-door.png",
      "text": {
        "en": "Poti stuck his head out of the door, and then there came Tini's voice, \"Good morning, Hami! The front door is open!\"",
        "de": "Poti streckte seinen Kopf aus der Tür, und Tinis Stimme folgte: \"Guten Morgen, Hami! Die Haustür ist geöffnet!\"",
        "zh": "波蒂从门后伸出脑袋来，紧接着传来了提妮的声音：“早上好，哈米！大门开着哦！”"
      }
    },
    {
      "imageUrl": "/comics/the-adventure-of-hami/00000011-tini-at-the-door.png",
      "text": {
        "en": "Tini pushed the door open and stepped into the room with Poti on her head. Suddenly, half of the room was lighted up by the warm sunshine. Tini said loudly, \"Hami, you left Poti yesterday at my place again! Hami? Have you already got up?\"",
        "de": "Tini drückte die Tür auf und ging ins Zimmer mit Poti auf seinem Kopf. Plötzlich wurde die Hälfe des Zimmers von dem warmen Sonnenschein erhellt. Tini sagte laut: \"Hami, du hast Poti gestern wieder bei mir hintergelassen! Hami? Bist du schon aufgestanden?\"",
        "zh": "提妮推开门，把波蒂举在头上走进门来。顿时，温暖的阳光照亮了半个屋子。提妮大声说道：“哈米，你昨天又把波蒂落在我哪里了！哈米？你起床了吗？”"
      }
    },
    {
      "imageUrl": "/comics/the-adventure-of-hami/00000012-tini-pokes-hami.png",
      "text": {
        "en": "Hami's eyebrows knitted in a frown. He was too concentrated to notice Tini's voice. Tini had never seen Hami thinking hard like this before. She walked to Hami and poked him, saying, \"Hey, Hami. What are you doing?\"",
        "de": "Hami zog stirnrunzelnd die augenbrauen zusammen. Er war zu konzentiert, um Tinis Stimme zu hören. Tini hat es noch nie gesehen, dass Hami so angestrengt denkt. Sie ging zu Hami, stupste Hami an, und sagte: \"Hey Hami? Was machst du gerade?\"",
        "zh": "哈米眉头紧锁着。他太专注了，根本没有注意到提妮在叫他。提妮还是第一次见到哈米思考得这么专注，她走到哈米身旁，戳了戳哈米，对哈米说：“喂，哈米。你在做什么呢？”"
      }
    },
    {
      "imageUrl": "/comics/the-adventure-of-hami/00000013-hami-is-startled.png",
      "text": {
        "en": "Hami was startled by Tini. He was so shocked, that he jumped up and kicked the desk accidentally, sending the coins on the desk into the air. His overreaction made Tini feel embarrassed.",
        "de": "Hami wurde von Tini aufgeschreckt. Er war so schockiert, dass er aufsprang und versehenlich gegen den Schreibtisch trat, wodurch die Münzen auf dem Tisch ins Luft flogen. Seine Überreaktion bringt Tini in Verlegenheit.",
        "zh": "哈米被突然出现的提妮吓得不轻。他吓得跳了起来，脚不小心踢到了桌子腿，桌子上的硬币之类的杂什顿时飞到了空中。提妮看着哈米的过度反应感觉尴尬极了。"
      }
    },
    {
      "imageUrl": "/comics/the-adventure-of-hami/00000014-travel-around-the-world.png",
      "text": {
        "en": "\"You scared me Tini!\" complained Hami and then said, \"I'm planing a world trip... Have you heard the stories told by those birds coming back from the migration? They were fascinating! I want to travel around the world too. I want to see the world out of the Heathland!\"",
        "de": "\"Du hast mich erschreckt\" beschwergte sich Hami, und dann sagt er: \"Ich planen gerade eine Weltreise... Hast du die Geschichte von den Vögln, die von dem Zug zurückgekommen sind, gehört? Sie sind faszinierend! Ich will auch um die Welt reisen. Ich will die Welt außerhalb der Heide sehen!\"",
        "zh": "“你可吓死我了！”哈米一边抱怨着，一边又接着说道，“我在计划世界旅行呢……你听过那些回到瓦纳荒原上的候鸟们讲的故事吗？真是太有趣了！我也想环游地球。我想看看荒原外面的世界是什么样子的！”"
      }
    },
    {
      "imageUrl": "/comics/the-adventure-of-hami/00000015-four-seasons-on-waane-heathland.png",
      "text": {
        "en": "Hami continued, \"I was fond of different views in four seasons on the Waane Heathland. However, when one year ends and then begins another, and it will be spring again. Everything will start from the beginning over and over. Don't you think it is quite boring like this year after year?\"",
        "de": "Hami erzählte weiter: \"Ich fand es interessant, dass es verschiedenen Szenen in vier Jahreszeiten auf der Waane Heide gibt. Aber wenn ein Jahr endet, und ein anderes beginnt, wird es dann wieder Frühling sein. Alles wird immer wieder von vorne anfangen. Findest du nicht, dass es so Jahr für Jahr ziemlich langweilig ist?\"",
        "zh": "哈米又接着说：“之前我一直觉得瓦纳荒原上有不同的季节，每个季节都有不同的景象非常有趣。可是一年过去，到了明年的时候，就又是春天了，又从头开始了。你不觉得这样一年一年地过去非常无聊吗？”"
      }
    }
  ]
}