{
  "pages": [
    {
      "imageUrl": "/comics/the-adventure-of-hami/00000001-cover.png",
      "text": {
        "en": "Cover page",
        "de": "Umschlagseite",
        "zh": "封面页"
      }
    },
    {
      "imageUrl": "/comics/the-adventure-of-hami/00000002-copyright.png",
      "text": {
        "en": "Copyright: 2022 Watermelon Puppet. All rights reserved.",
        "de": "Urheberrecht: 2022 Watermelon Puppet. Alle Rechte vorbehalten.",
        "zh": "版权声明：2022年，西瓜玩偶。保留所有权利。"
      }
    },
    {
      "imageUrl": "/comics/the-adventure-of-hami/00000003-chapter-0-cover.png",
      "text": {
        "en": "Chapter 0: Character Introduction",
        "de": "Kapitel 0: Charaktervorstellung",
        "zh": "第0章：登场动物介绍"
      }
    },
    {
      "imageUrl": "/comics/the-adventure-of-hami/00000004-character-intro-hami.png",
      "text": {
        "en": "Hami (pronounciation: hah-mee): the main character of our story, a hamster in light grey fur, living in a hole under a tree on Waane Heathland. He is optimistic, playful and full of curiosity. Not like other glires, he is brave and adventurous. For playing, he wants to try any kind of activity; for his curiosity, he wants to investigate any sort of anomaly. He rarely thinks before acting, not even to mention \"think twice\". No matter what kind of an idea comes to his mind, he can't help to try it out immediately. As a result, he is always in trouble. Fortunately, each time he gets into the difficult situation, his friends will help him out. Besides, he always comes up with some weird ideas too, in addition with a little bit luck, he can always escape unscatched from those trouble situations.",
        "zh": "哈米（Hami）：故事的主人公，是一只浅灰色的仓鼠，住在瓦纳荒原上一棵大树下面的树洞里。他非常乐天派、爱玩，并且对什么事物都充满了好奇心。不像是其他的啮齿类动物，他的胆子很大。为了玩，不管是什么他都想要试一试；为了满足他的好奇心，不管是什么响动他都想要去看个究竟。他做事情之前很少思考，更不懂得什么叫做“三思而后行”了，只要他一想到什么点子，身体就会不由自主地开始动起来去做那件事情，所以经常让自己卷入一些麻烦里。幸好，每次遇到困境，他的朋友都会来帮他的忙。而且他自己也经常临机应变想出一些奇怪的点子，再借着一点点运气，他每次总是能摆脱困境。"
      }
    },
    {
      "imageUrl": "/comics/the-adventure-of-hami/00000005-character-intro-tini.png",
      "text": {
        "en": "Tini (pronounciation: tee-nee): Hami's best friend, a tiny, golden-colored field mouse. She lives deep in a bush on Waane Heathland. Her favourite thing is picking the little flowers by the roadside and put them on her head. She is intelligent, careful and cautious, and always foresighted. Each time she and Hami get stuck in trouble, she is always the one who comes up with ideas. However, sometimes she could also be overcautious and perfectionistic. She is quite gliran. Once there is any little noise, she would hide herself away. Although Hami's adventurous characteristic gives her a headache, she will join Hami in any activity, since what Hami does seems so interesting and irresistable to her. And each time when Hami get into trouble, she always tries her best to help.",
        "zh": "提妮（Tini）：哈米的好朋友，是一只金黄色的姬鼠，身材娇小。她住在瓦纳荒原上一片灌木丛的最深处。她最喜欢做的事情就是把路边新鲜的小野花采下来戴在头上。她很聪明，非常仔细、谨慎，做事也很有预见性。每次她和哈米遇到困难的时候，她总是担当起智囊的角色。不过她也因为这样的性格有点谨小慎微，有的时候还会有一点完美主义。她的性格是典型的啮齿类动物的性格，只要一有什么风吹草动就会躲得远远的。虽然对哈米招麻烦的体质非常苦恼，但是每一次又因为哈米做得事情太有趣而忍不住加入哈米。而且每一次哈米陷入困境的时候，她都会想方设法地去帮他。"
      }
    },
    {
      "imageUrl": "/comics/the-adventure-of-hami/00000006-character-intro-poti.png",
      "text": {
        "en": "Poti (pronounciation: po-tee): Hami and Tini's mascot, a doll that Tini gives Hami as a gift. It is a white hamster with a little pot on its head and a sunflower seed in its hands. In theory, Tini gave Poti to Hami, to remind Hami that he shouldn't do anything stupid, and Hami should bring it with him all the time and take care of it. However, the careless and playful Hami always forgets to do this. So actually the time that Poti stays with Tini is even longer than it is with Hami.",
        "zh": "波蒂（Poti）：哈米和提妮两只鼠的幸运吉祥物，是提妮作为礼物送给哈米的绒布玩偶。它的形象是一只顶了一口小锅的白色仓鼠，手里还捧着一颗葵花籽。名义上，它是提妮为了提醒哈米不要乱跑、不要干傻事才送给哈米的，并且要求哈米随时把它带在身边照顾好它。可是粗心的哈米总是因为贪玩而忘记带上波蒂，所以波蒂跟着提妮的时间比跟着哈米的时间还要长。"
      }
    },
    {
      "imageUrl": "/comics/the-adventure-of-hami/00000007-chapter-1-cover.png",
      "text": {
        "en": "Chapter 1: An Acorn in the Sky",
        "de": "Kapitel 1: Eine Eichel im Himmel",
        "zh": "第1章：天空中的橡子"
      }
    },
    {
      "imageUrl": "/comics/the-adventure-of-hami/00000008-a-morning-on-waane-heathland.png",
      "text": {
        "en": "Another wonderful sunny morning, the whole Waane Heathland is covered by peacefulness.",
        "de": "Wieder ein wunderschöner sonniger Morgen, die ganze Waane Heide wird von Friedlichkeit bedeckt.",
        "zh": "又是一个美丽而又晴朗的早晨，瓦纳荒原上洋溢着一片祥和的气氛。"
      }
    },
    {
      "imageUrl": "/comics/the-adventure-of-hami/00000009-hami-is-thinking.png",
      "text": {
        "en": "Hami wakes up quite early, and seems to be planing something, which doesn't look like the usual Hami at all.",
        "de": "Hami steht ziemlich früh auf, und es sieht so aus, dass er gerade irgendwas planen, ganz anders als der übliche Hami.",
        "zh": "哈米早早地就起了床，似乎在计划着什么——这可一点都不像是平常的哈米。"
      }
    },
    {
      "imageUrl": "/comics/the-adventure-of-hami/00000010-poti-behind-the-door.png",
      "text": {
        "en": "Poti sticks his head out of the door, and then there comes Tini's voice, \"Good morning, Hami! The front door is open!\"",
        "de": "Poti streckt seinen Kopf aus der Tür, und Tinis Stimme folgt: \"Guten Morgen, Hami! Die Haustür ist geöffnet!\"",
        "zh": "波蒂从门后伸出脑袋来，紧接着传来了提妮的声音：“早上好，哈米！大门开着哦！”"
      }
    },
    {
      "imageUrl": "/comics/the-adventure-of-hami/00000011-tini-at-the-door.png",
      "text": {
        "en": "Tini pushes the door open and steps into the room with Poti on her head. Suddenly, half of the room has been lighted up by the warm sunshine. Tini says loudly, \"Hami, you left Poti yesterday at my place again! Hami? Have you already got up?\"",
        "de": "Tini drückt die Tür auf und geht ins Zimmer mit Poti auf seinem Kopf. Plötzlich wird die Hälfe des Zimmers von dem warmen Sonnenschein erhellt. Tini sagt laut: \"Hami, du hast Poti gestern wieder bei mir hintergelassen! Hami? Bist du schon aufgestanden?\"",
        "zh": "提妮推开门，把波蒂举在头上走进门来。顿时，温暖的阳光照亮了半个屋子。提妮大声说道：“哈米，你昨天又把波蒂落在我哪里了！哈米？你起床了吗？”"
      }
    }
  ]
}