{
  "title": {
    "en": "About",
    "de": "Über",
    "zh": "关于"
  },
  "time": {
    "date": "2022-09-04",
    "time": "18:41:00",
    "timeZone": "Europe/Berlin"
  },
  "location": {
    "name": {
      "en": "Home",
      "de": "Zuhause",
      "zh": "家中"
    }
  },
  "blocks": [
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "Ok, now you are reading this webpage. This is crazy! There is such a huge amount data flying over the whole Internet, and you have found my blog, while this is already one thing, and then you have started reading the \"About\" page of my blog, which is another thing completely on a different level.",
        "zh": "太神奇了！我还从来没想过有人会看这个网页。网上每天有海量的信息飞来飞去，可是你确偏偏发现了我的博客。不过发现了我的博客还不算稀奇，关键是你还开始看我写的这篇“关于”来了。你说这是不是一种缘分。"
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "Well, anyways, welcome to my blog!",
        "zh": "无论如何，欢迎到我的博客来做客！"
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "This blog is all about _time_.",
        "zh": "这个博客里面的内容都是跟**时间**有关的……"
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "But what is _time_? It might be the ticks from a clock on the wall, or the oscillation of a quartz crystal, or even the radiation generated by the electron transition of the caesium 133 atom. But these are all mechanic, these are all artificially invented or defined for meassurement of the time. However, we all know the concept of time even before there is any clock on the wall. So the question is rather, what is _time to me_?",
        "zh": "不过这个**时间**究竟是个什么东西呢？时间可以是墙上的时钟发出的滴答声，或者是石英晶体的振动，甚至可以是铯133原子的电子跃迁产生的辐射。不过这些也太机械了，它们无非都是人类创造或者定义出来的，用来计时的技术罢了。而我们根本不需要什么挂钟就可以体会到时间的存在。所以这个问题更好的问法恐怕应该是“**时间对我来说**是什么”。"
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "For me, the time is the interaction between changes, observations and memories.",
        "zh": "对我来说，时间是变化、观察与记忆相互作用的产物。"
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "Imagine a world without any alternation, transformation, or without any change, which means there will be no days and nights, no river flowing, no leaves turning yellow and green, no aging, everything stays the same forever. I believe in such a world I won't be able to understand the concept of time. In such a world, I couldn't even think, because thinking is also a sort of change happens in my head. Thus change must be a necessary element of time.",
        "zh": "想象一下，如果世界上没有任何变化，也就是说没有什么白天和黑夜、河水不再流淌、树叶不会变绿变黄、没有什么衰老，所有的事物都是永久地一成不变。我觉得我在一个这样的世界里绝对不会理解时间的概念的。其实在这样的世界里，我连思考都不能。毕竟思考也是我的脑袋里发生的变化。所以变化是时间的一个必要的元素。"
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "What about observation then? What if I stay in a dark room forever? Although the world is spinning like crazy everyday, but only outside of the room, not for me. I can't observe any changes in the world, thus the changes outside of the room, those days, nights, months and years wouldn't make any sense to me. In this case, I still won't understand what is time. It seems that observation is just another key of understanding time.",
        "zh": "那么观察又作何解呢？如果我一辈子都呆在一个小黑屋里会怎样？虽然世界一刻不停地在疯狂旋转着，但是那也只是屋外的世界，对我来说可不是这样。我没法观察世界的变化，也就是说哪些白天、黑夜、年月更替，对我来说都没有任何意义。这样一来，我还是没法理解什么是时间。所以看来观察也是理解时间的另外一个关键。"
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "But if there are changes, and I can observe those changes, does it mean that I will understand what time is? Well, I think not really. Because I have to recognize a chain of changes to be able to get the concept of time. If I don't remember what has happened, everything for me is just completely new and separated and independent. They just happens. Since I don't remember anything, I won't know any connection between them, I won't even know the current change is happening after another. They are just a set of random phenomena, instead of a constant stream which can help me to understand the term \"time\". And memory, just like what have been discussed before, is one of the necessary building blocks of the recognition of the constant stream of changes, thus also necessary for understanding time.",
        "zh": "如果有了变化，我又能观察到这些变化，这就意味着我能理解什么是时间了吗？也不尽然。因为我必须要认知到一连串的变化，才有可能理解时间的概念。如果我都不记得发生过什么，那么所有的事情对我来说就都是新的、相互独立分离的。我会觉得世界上一直都有事情在发生而已。因为我没法记住任何事情，我也不可能理解到事情之间的联系，我甚至都不知道当下我正在观察的变化发生在另外一个变化之后。所有的变化都是一组随机的现象，而不会形成一个持续的变化流，而只有变化形成了一连串的变化流之后才能让我理解时间的含义。至于记忆嘛，如前所述，它是形成对这种变化流的认知的必要因素，同时也就成了理解时间的必要因素了。"
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "Once there is something changing, and I can recognize it, and then I can remember it, and then another change that I can recognize too, and so on so forth, only so I'll be able to chain those changes together in my head, form a constant stream of changes, and then the illustration of \"time flies\" will finally get clear.",
        "zh": "一旦有了变化，我又能认知到，然后我又能记住，然后又来另外一个变化，又被我认知到，如此往复……只有这样，我才能把所有这些变化在我的脑子里串起来，形成一个持续的变化流。然后那种”时间飞逝“的景象就可以慢慢浮现在我的脑海中了。"
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "And this blog is all about _time_. It is all about the interaction between changes, observations and memories.",
        "zh": "所以，这个博客里面的内容都是跟**时间**有关的，它们都是变化、观察与记忆相互作用的产物。"
      }
    }
  ]
}
