{
  "title": {
    "en": "Continental Typewriter Repaired",
    "zh": "修理好的Continental打字机"
  },
  "time": {
    "date": "2022-10-18",
    "time": "23:45:00",
    "timeZone": "Europe/Berlin"
  },
  "location": {
    "name": {
      "en": "Home",
      "de": "Zuhause",
      "zh": "家中"
    }
  },
  "blocks": [
    {
      "type": "ImageBlock",
      "url": "/images/2022-10-18--typewriter-repaired.jpg",
      "description": {
        "en": "Typewriter repaired",
        "zh": "修好的打字机"
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "The village where I'm living had organized a flea market at the end of the September. A lot of people were selling their stuff that were covered by the thickest layer of dirt. I'm not quite into antique to be honest, but I do like those cheap old used products. If it is useful to me, and I can buy it as used at a low price, then why not?",
        "zh": "9月末的时候，村子里组织了一个跳蚤市场，好多人都拿着家里吃灰最多的东西出来卖。我虽然不是什么古董爱好者，但是我很喜欢一些好用的二手旧货。如果是自己真的需要，然后又恰好可以买到便宜的二手货的话何乐而不为呢。"
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "The flea market was quite small, after all there are only about 500 people in the village. Despite the fact that the people in the neighbour villages were also selling their stuff there, there were only three rows of stands in a small parking place. I picked up two things after a whole morning of eye-shopping. One of them was an old laptop bag, and the other one was this quite old but yet tasteful-looking typewriter.",
        "zh": "跳蚤市场并不大，毕竟村子也就几百个人，就连隔壁村的人都来这里摆摊了。就算这样，来摆摊的人也就在小小的停车场上排了三排。转了一上午之后，我挑了两个让我觉得很满意的东西。一个是看起来稍微有点旧的电脑包，另一个就是这台看起来相当古旧，又非常有味道的打字机。两个东西加起来也就只花了我15欧而已。"
      }
    },
    {
      "type": "ImageBlock",
      "url": "/images/2022-10-18--mechanical-details-of-typewriter-01.jpg",
      "description": {
        "en": "Mechanical details of the typewriter",
        "zh": "打字机的机械细节"
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "The model of the typewriter is unknown to me. The only information that I've got is the sticker that has \"Continental Wanderer-Werke A.G. Chemnitz\" written on it, and the text \"Continental\" being painted on a piece of metal platte. The Internet doesn't help much neither. I only know that this model was designed way back in the year of 1904, with more than 60 patents being applied. About 40 years after that, the design of this typewriter has never been changed, which means this typewriter was produced latest in the 1940s, and it is at least 80 years old now.",
        "zh": "我不太清楚打字机的型号。唯一的信息只有打字机前面“Continental Wanderer-Werke A.G. Chemnitz”的贴纸，还有一块金属板上面“Continental”的字样。网上查了老半天也没有更多的信息，只知道它大概是在1904年设计的，申请了60多项专利。此后的40多年中，它的设计一直没有变过。这也就意味着这台打字机最晚的生产年份应该是在1940年代，到现在也至少也经历了将近80年的春秋了。"
      }
    },
    {
      "type": "ImageBlock",
      "url": "/images/2022-10-18--mechanical-details-of-typewriter-02.jpg",
      "description": {
        "en": "Mechanical details of the typewriter",
        "zh": "打字机的机械细节"
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "After I had brought the typewriter back, the typewriter was not working at all. I wasn't actually planning to use it to write anything. I just think it would be perfect if I could clean it and put it into my room as a decoration. However, after I had examined it carefully, I found out that it was actually not that hard to repair it. Some keys were sticking together, the spring in the back was loose, and the cast iron frame was broken. Other than that, everything was fine.",
        "zh": "打字机刚刚拿回来的时候几乎是处于无法工作的状态的，我买的时候也没有考虑过真的拿它来打字。我只是觉得如果能把它清理干净，放在房间的某个角落里，或许看起来会不错。不过仔细端详了一番之后，我觉得要想修理好它似乎也不是什么困难的事情。有几个按键黏在了一起，背后的弹簧也松了，铸铁的框架也有一个地方断裂了。除此之外，其余的部分完好无损。"
      }
    },
    {
      "type": "ImageBlock",
      "url": "/images/2022-10-18--mechanical-details-of-typewriter-03.jpg",
      "description": {
        "en": "Mechanical details of the typewriter",
        "zh": "打字机的机械细节"
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "I simply used a rag, an old toothbrush and a vaccum cleaner to remove the dirt on the typewriter. For the broken cast iron framework, I was thinking about welding the broken cast iron frame and then sanding down the weld line at first. For that I had consulted a retired mechnician in the village, but he said that it would be hard to weld cast iron, instead, using glue would be a better choice, since the glue would be strong enough, and it would look good too. At the end, he helped me glue up the broken part for free just for the sake of neighbourhood, which I appreciated a lot. The loosing spring was easy to deal with. There is actually a little part designed for adjusting the spring. What I had to do was just removing the screw holding that part, and turning it like winding a clock. After that, the spring was tight.",
        "zh": "我简单地用抹布、旧牙刷和吸尘器清理了一下打字机上面的浮尘。为了修理断裂的铸铁框架，本来我是想要问村子里的人借用一下电焊，把铸铁框架断裂的部分焊起来，然后打磨平整的。结果问了村子里的一个退休的机械师之后，他说铸铁要想焊起来的话效果恐怕不会很理想。用胶粘接的话，强度足够，对外观也不会有太大的影响。因为是邻居的关系，他后来免费帮我用胶粘好了铸铁断裂的部分，我为此非常感谢他。松掉的弹簧比较好处理，其实弹簧上有一个小装置可以调整弹簧的松紧，只要松开固定的螺丝钉，然后像上发条一样就可以把弹簧上紧了。"
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "The keys were sticking together because of the bent arms for those letters. The bent arms made them so close to each other, that one arm was touching the other. For repairing it, I applied a little bit brutal force to make the arms straight, so that they were separated from each other. Some other arms stay at the place after the keys were pressed, and won't come back to their original places. I applied some WD-40 on the axles of those arms for removing the rust and lubricating the turning part. After having hit those keys several times, they became smooth again.",
        "zh": "按键之所以黏在了一起，是因为有几个字母的摇臂弯曲了，间距过近，一根摇臂贴到了另一根摇臂上。只要小心地用点力气把弯曲的摇臂掰直，让两个摇臂分开来就好了。不过有些字母敲击过后，摇臂不会回到原来的位置上。为此，我在摇臂转轴的位置喷了一些WD-40，主要是为了除锈加上润滑。多按几次按键之后，很快摇臂就变得顺畅起来。"
      }
    },
    {
      "type": "ImageBlock",
      "url": "/images/2022-10-18--mechanical-carriage-return.jpg",
      "description": {
        "en": "A mechanical carriage return",
        "zh": "机械的回车"
      }
    },
    {
      "type": "ImageBlock",
      "url": "/images/2022-10-18--mechanical-caplock.jpg",
      "description": {
        "en": "A mechanical caplock",
        "zh": "机械的大写锁定"
      }
    },
    {
      "type": "ImageBlock",
      "url": "/images/2022-10-18--real-mechanical-keyboard.jpg",
      "description": {
        "en": "The real mechanical keyboard",
        "zh": "真正的机械键盘"
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "The mechanical part of the typewriter were fixed. To really use it, I still need a role of ribbon. But the ribbons for such an ancient model must be out of production for decades already. I carefully examined the metal ribbon spool, and found that there is actually a hook on the spool. If I punch a hole on the ribbon, then I could hook it onto the spool. So I bought a ribbon on Amazon for the modern typewriters, and cut a piece off, punch a hole on each end of the ribbon, and wind it onto the spool. And it worked! Although some letters weren't written very clearly, but considering the fact that the typewriter was probably over 80 years old already, one cannot ask to much out of it.",
        "zh": "打印机的机械部分修好了，不过真的要想打字的话还缺一卷色带。可是这么老的古董级打印机，色带肯定早就停产了。我仔细端详了一下金属的色带转轴，发现转轴上面其实有一个钩子。只要色带上有一个孔，就可以把色带钩在转轴上。于是我在Amazon上面买了一卷现代打印机用的色带，然后剪了一段下来，两边各打了一个孔，钩在了打印机色带的转轴上。之后我试了一下，果然能打出字来。虽然有很多字母打出来的效果并不是非常理想，但是打字机毕竟有80多年的岁数了，我还能对它有什么要求呢。"
      }
    },
    {
      "type": "ImageBlock",
      "url": "/images/2022-10-18--typewriter-with-paper-loaded.jpg",
      "description": {
        "en": "Typewriter with paper loaded",
        "zh": "装了纸的打字机"
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "I was super happy about the typewriter being repaired. I typed a lot after that, e.g. the introduction of my comic, the name of the website, and even a message to the one who sold me the typewriter. She is the barber in the village, thus I wrote a message with the typewriter for making the next haircut appointment, and then took a photo with my phone and sent to her.",
        "zh": "打字机能用之后，我开心地打了好多东西。比如说我的漫画的英文介绍、网站的名字，甚至还打了一段消息，用手机拍了照，发给了卖给我打印机的人。她是村子里的理发师，所以我用打字机写了一段消息，跟她约了下一个理发的时间。"
      }
    },
    {
      "type": "ImageBlock",
      "url": "/images/2022-10-18--website-name-written-by-typewriter.jpg",
      "description": {
        "en": "The website name written by the typewriter",
        "zh": "打字机打的网站名称"
      }
    },
    {
      "type": "ImageBlock",
      "url": "/images/2022-10-18--comic-intro-written-by-typewriter.jpg",
      "description": {
        "en": "The introduction of \"The Adventure of Hami\" written by the typewriter",
        "zh": "打字机打的《哈米历险记》的介绍"
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "I guess I won't use the typewriter to write anything in the future. I'll stick to my original plan, put it into my room, make it a decoration. But the mechanically functioning state of the typewriter adds a lot of values to its decorating purpose. But, of course, at the end of the day, the process of repairing it was the most fun part of the whole story.",
        "zh": "估计之后我也不会拿这台打字机来用，应该就是按照原计划，把它放到房间的某个角落当装饰品而已。不过同样都是装饰品，一台能工作的打字机和一台不能工作的打字机的价值就完全不一样了。当然，把它修理好的过程才是最重要也是最有趣的部分。"
      }
    }
  ]
}