{
  "title": {
    "en": "Bergischer Short Hiking Trails #1 — Cloth-Maker Road",
    "zh": "贝吉舍短途徒步路线之一——纺织工之路"
  },
  "time": {
    "date": "2022-11-05",
    "time": "14:15:00",
    "timeZone": "Europe/Berlin"
  },
  "location": {
    "name": {
      "en": "Home",
      "zh": "家中"
    },
    "coord": {
      "lat": 51.204297,
      "long": 7.358135
    }
  },
  "thumbnailImageUrl": "https://live.staticflickr.com/65535/52484858399_e0e8b27c91_k_d.jpg",
  "excerpt": {
    "en": "I found a set of short-distance hiking trails in Bergisches Land, which are called \"Bergische Streifzüge\" in German. There are 24 of them in total, each of them is about 5 to 15 km long, and each of them has a different theme, which are perfect for weekend trips. I'd like to do them all one by one, and this time, I'd finish the first trail.",
    "zh": "我找到了一组贝吉舍斯兰的短途徒步路线，德语叫做“Bergische Streifzüge”。这组路线总共有24条，每一条路线的长度大概都在5到15公里之间，而且每一条路线都有一个特定的主题。这样的路线非常适合周末旅行。我想要把它们一条一条地都走下来。而这次，我计划完成第一条路线。"
  },
  "blocks": [
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "I had a long vacation at the Halloween time. In this vacation I did a lot of creative work: I designed and sewed my new wallet, improved the implementation of my blog, produced a new piece of music, and finished several comic pages. At the end of the long vacation, I finally decided to enjoy some nature in the surrounding area.",
        "zh": "万圣节期间我请了一个长假。长假里我做了不少创造性的工作：我设计制作了一个新钱包，改善了博客的实现，制作了一首曲子，还完成了好几页漫画。在长假的末尾，我终于下定决心，是时候到周边的大自然里面转一转了。"
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "There are quite a few water reservoirs and dams in Bergisches Land, but I'd say I have already visited almost all of them. It would be great to try something new this time. Some hiking among the hills or along the rivers would be perfect. After some homework, I found a set of short-distance hiking trails in Bergisches Land, which are called \"Bergische Streifzüge\" in German. There are 24 of them in total, each of them is about 5 to 15 km long, and each of them has a different theme, which are perfect for weekend trips. I'd like to do them all one by one, and this time, I'd finish [the first trail](https://www.bergisches-wanderland.de/tour/tuchmacherweg-streifzug-1). The name of this trail is \"Tuchmacherweg\", which can be directly translated to \"Cloth-Maker Trail\", or \"Textile Manufacturing Trail\"",
        "zh": "虽然贝吉舍斯兰（Bergisches Land）有不少水库和大坝，不过大多数我都已经去过了。如果这次我能去一些不一样的地方的话就是再好不过的了，比如说在山里面或者是在河边徒步就很不错。做了一些功课之后，我找到了一组贝吉舍斯兰的短途徒步路线，德语叫做“Bergische Streifzüge”。这组路线总共有24条，每一条路线的长度大概都在5到15公里之间，而且每一条路线都有一个特定的主题。这样的路线非常适合周末旅行。我想要把它们一条一条地都走下来。而这次，我计划完成[第一条路线](https://www.bergisches-wanderland.de/tour/tuchmacherweg-streifzug-1)。这条路线的名字叫做“Tuchmacherweg”，直译过来就是“纺织工之路”，或者是“纺织厂之路”。"
      }
    },
    {
      "type": "ImageBlock",
      "url": "https://live.staticflickr.com/65535/52482088986_aedabe23f0_k_d.jpg",
      "description": {
        "en": "The start of the \"Cloth-Maker Trail\", Radevormwald, a peaceful town",
        "zh": "“纺织工之路”的起点，拉德符姆瓦尔德（Radevormwald），一座安静的小镇"
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "The \"Cloth-Maker Trail\" starts from Radevormwald, a peaceful town in Bergisches Land, surrounded by hills. The buildings there are all in \"bergisch\" colors, grey, green and white. A lot of building in Bergisches Land have facades covered by grey tiles and the doors and windows are in light green, the door and window frames are usually in white. This color scheme reminds me of the forest here, because in spring, the light green moos climbs onto the grey tree trunks. Sometimes there is also a little bit snow not yet melted, which adds some white to the scene. That is exactly the \"bergisch\" color-scheme.",
        "zh": "“纺织工之路”的起点是拉德符姆瓦尔德（Radevormwald）——一座坐落在贝吉舍斯兰里的小镇，被矮矮的丘陵所环绕。那里的建筑物的配色是非常典型“贝吉舍”主题色——灰色、绿色和白色。贝吉舍斯兰的建筑物的外墙大多数都是被灰色的瓦片覆盖，窗户和门漆成亮绿色，门框和窗框则是白色的。这样的配色总是让我想起贝吉舍斯兰的树林，如果在春天去这里的树林里转一圈的话，就可以发现好多灰色的树干上面长满了亮绿色的苔藓。有的时候还有一点点没有融化的积雪，给这个景色增添了一点白色。这完全就是“贝吉舍”的主题色了。"
      }
    },
    {
      "type": "ImageBlock",
      "url": "https://live.staticflickr.com/65535/52482088871_9b338d28d7_k_d.jpg",
      "description": {
        "en": "A building in typical \"bergisch color-scheme\"",
        "zh": "一栋典型的“贝吉舍配色风格”的建筑物"
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "The trail led me out of the town first, and then into the forest, through a farm, cross the country road, and then into the forest again. The weather was not perfect, since it was mostly cloudy and sometimes even raining, but the scenary was beautiful. In the forest, the trees were trembling in the cold autumn breeze, shaking the leaves off. The leaves fell onto the ground, covered the trail in the forest, and painted the whole ground in bright yellow. Trees fell asleep in autumn, but the moos and the mushrooms just woke up. Wherever not yet covered by the leaves was almost covered by moos, and those mushrooms stuck there heads out of the leaves, enjoying the cold and fresh air after the rain. On the farmland, the farmers had probably just mowed the grass recently, which made the light green color evenly distributed on the pasture, creating a beautiful contrast with the trees at the far end of the land.",
        "zh": "我一路沿着小路走出了小镇，走进了树林，然后穿过了一座农场，横穿过一条乡村小路，然后又一头扎进了树林里。天气并不是很好，大多数时间都是多云，有的时候还下着毛毛细雨，不过沿路的景色真的很棒。树林里，树木在秋风中瑟瑟发抖，把树上的树叶纷纷抖落到了地面上，把林间的小路全都盖住了，整个地面都被落叶染成亮黄色。树木在秋天纷纷进入了沉睡，但是那些苔藓和蘑菇仿佛是刚刚醒。地面上只要没有被落叶覆盖的地方几乎都被苔藓盖住了。蘑菇们从落叶堆中探出头来，享受着雨后又寒冷又新鲜的空气。农场上，农夫们恐怕是刚刚割了草场上的草，亮绿色均匀地分布在整个草场上，跟远处树木的颜色形成了非常漂亮的对比。"
      }
    },
    {
      "type": "ImageBlock",
      "url": "https://live.staticflickr.com/65535/52480175624_dc47c4f36c_k_d.jpg",
      "description": {
        "en": "It was raining",
        "zh": "毛毛细雨"
      }
    },
    {
      "type": "ImageBlock",
      "url": "https://live.staticflickr.com/65535/52480182144_5067277049_k_d.jpg",
      "description": {
        "en": "The ground in the forest is covered by leaves",
        "zh": "树林里的地面被落叶覆盖满了"
      }
    },
    {
      "type": "ImageBlock",
      "url": "https://live.staticflickr.com/65535/52480197199_d055521149_k_d.jpg",
      "description": {
        "en": "Bare branches and trunks in the forest",
        "zh": "树林里光秃秃的树枝和树干"
      }
    },
    {
      "type": "ImageBlock",
      "url": "https://live.staticflickr.com/65535/52482138129_e1997a1eec_k_d.jpg",
      "description": {
        "en": "Wherever not being covered by leaves is covered by moos",
        "zh": "没被落叶覆盖的地方就是被苔藓覆盖着"
      }
    },
    {
      "type": "ImageBlock",
      "url": "https://live.staticflickr.com/65535/52481863496_8cf10784d4_k_d.jpg",
      "description": {
        "en": "Forest stops here, and the farmland starts",
        "zh": "树林到此为止，接下去是一片农场"
      }
    },
    {
      "type": "ImageBlock",
      "url": "https://live.staticflickr.com/65535/52482124574_515bbd4e76_k_d.jpg",
      "description": {
        "en": "A mini house in the middle of a pond, probably owned by a squirrel family",
        "zh": "池塘中间的微型农庄，主人恐怕是松鼠的一家"
      }
    },
    {
      "type": "ImageBlock",
      "url": "https://live.staticflickr.com/65535/52482432863_9edb5a3124_k_d.jpg",
      "description": {
        "en": "Pasture",
        "zh": "草场"
      }
    },
    {
      "type": "ImageBlock",
      "url": "https://live.staticflickr.com/65535/52481928986_54428ebac9_k_d.jpg",
      "description": {
        "en": "Pasture",
        "zh": "草场"
      }
    },
    {
      "type": "ImageBlock",
      "url": "https://live.staticflickr.com/65535/52482494788_da97aea272_k_d.jpg",
      "description": {
        "en": "Moos on an old wooden post",
        "zh": "木桩上的苔藓"
      }
    },
    {
      "type": "ImageBlock",
      "url": "https://live.staticflickr.com/65535/52482460525_658b2c4813_k_d.jpg",
      "description": {
        "en": "Heading into another forest",
        "zh": "走进另外一片树林"
      }
    },
    {
      "type": "ImageBlock",
      "url": "https://live.staticflickr.com/65535/52482551128_11108d17ab_k_d.jpg",
      "description": {
        "en": "Mushrooms",
        "zh": "蘑菇"
      }
    },
    {
      "type": "ImageBlock",
      "url": "https://live.staticflickr.com/65535/52481540787_893089dd38_k_d.jpg",
      "description": {
        "en": "A tiny waterfall, running down... like hundred centimeters?",
        "zh": "一条微型瀑布，飞流直下……大概三尺？"
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "I thought I could finish the whole trail in one day and then get back to my car parked in Radevormwald, but soon I realised that it was not possible at all. It was getting dark soon, since the day gets shorter, and daylight saving time was also ended several days ago. I had to get back from the middle of the trail and continue in the next day.",
        "zh": "我本以为能在一天之内完成整条徒步路线，然后回到停在拉德符姆瓦尔德的车子那里。但是很快我就意识到这个计划行不通。到了年末，白天的时间变得很短，再加上几天之前刚刚改成冬令时的缘故，夜幕很快就降临了。我不得不从徒步路线的中间返回车子那里，第二天再继续完成这条徒步路线。"
      }
    },
    {
      "type": "ImageBlock",
      "url": "https://live.staticflickr.com/65535/52482664743_c384982602_k_d.jpg",
      "description": {
        "en": "The trees were shaking off the leaves in the cold autumn breeze",
        "zh": "树木在秋日的寒风中抖落一身的树叶"
      }
    },
    {
      "type": "ImageBlock",
      "url": "https://live.staticflickr.com/65535/52482389119_d36acdc9d6_k_d.jpg",
      "description": {
        "en": "Day is short in this time",
        "zh": "这个时间的白天非常短"
      }
    },
    {
      "type": "ImageBlock",
      "url": "https://live.staticflickr.com/65535/52482607960_6ed1ba233a_k_d.jpg",
      "description": {
        "en": "Country road going through the forest",
        "zh": "穿过树林的乡村公路"
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "In the next day, I got up very early, because I wanted to start early, so that I could finish the rest of the trail, and then get back to my car. Instead of continuing from where I stopped in the last day, I started from the other end of the trail, a parking place near the dam on Wupper (Wuppertalsperre). Once I arrived the parking place, I was wondering why there was no parking lot there. But soon I realised that, they were actually all covered by the grass growing out from the middle of the bricks. The grass are well organised in those bricks, just like a grass buffet. In the morning, the weather was better than the afternoon in the last day. Blue sky, white clouds, green grass and trees, a good mood is garanteed by such a beautiful scenary.",
        "zh": "第二天，我早早就起了床，因为我想早一点出发，这样我就可以完成徒步路线剩下的部分，然后再返回我停车的地方了。我没有从昨天中途折返的地方继续前进，而是把车开到了这条徒步路线的另外一头——伍珀河水坝（Wuppertalsperre）旁边的一个停车场。刚到停车场的时候，我还在纳闷怎么这个停车场上都没有停车位。不过我马上就明白过来，原来停车位都被从地砖中间长出来的草给盖住了。那些草在地砖中间长得整整齐齐的，活像是“青草自助餐”。这天清晨的天气比昨天下午的好，蓝天白云青草绿树，一下就让人变得心情舒畅起来。"
      }
    },
    {
      "type": "ImageBlock",
      "url": "https://live.staticflickr.com/65535/52481891042_02eeea10c7_k_d.jpg",
      "description": {
        "en": "All you can eat grass buffet",
        "zh": "青草自助餐，请尽情享用"
      }
    },
    {
      "type": "ImageBlock",
      "url": "https://live.staticflickr.com/65535/52481890857_b64fa7e29c_k_d.jpg",
      "description": {
        "en": "A tree in the middle of a pasture near the parking place",
        "zh": "停车场旁边草场中央的一棵树"
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "The trail was going through the dam, heading into a forest. At the end of the forest, there was a small village. In the village started a railway. And there were also some old buildings, which seems to belong to an abandoned industry.",
        "zh": "小路带着我穿过大坝，走进一片小树林。在树林的尽头是一座小村庄，有一条铁路就是从这条小村庄开始的。小村庄里还有一些上了年纪的老房子，看上去像是某个废弃的工厂的一部分。"
      }
    },
    {
      "type": "ImageBlock",
      "url": "https://live.staticflickr.com/65535/52484888663_165dc70fb1_k_d.jpg",
      "description": {
        "en": "The iron gate of a storage",
        "zh": "仓库的大铁门"
      }
    },
    {
      "type": "ImageBlock",
      "url": "https://live.staticflickr.com/65535/52484799445_2a80faaadf_k_d.jpg",
      "description": {
        "en": "In rust we trust",
        "zh": "锈迹让人清晰地体会到时光的流逝"
      }
    },
    {
      "type": "ImageBlock",
      "url": "https://live.staticflickr.com/65535/52484799720_603bb4429a_k_d.jpg",
      "description": {
        "en": "Abandoned buildings",
        "zh": "废弃的建筑物"
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "In the first day, I was wondering why this trail is called \"Cloth-Maker Road\", and I figured out soon in the second day. Actually those buildings indeed belong to a factory, which was probably quite active in the 19th centry, or even in the beginning of the 20th centry. At that time, the area along the Wupper was an important industry area. Most of the industries were textile manufacturers. There were villages built by those factories, which were homes of the workers and their families. The railway was probably also built for transporting the raw materials and the products of those factories. However, they are all being abandoned somehow. The villagers who live there nowadays are not working for the factories anymore, and can enjoy the peacefulness of the Wupper and the nature. However, their parents or grandparents probably still remember the old days when the loud machines turning day and night, and the black clouds coming out of those high chimneys. What a crazy era.",
        "zh": "第一天的时候，我一直在想为什么这条路要叫做“纺织工之路”，第二天的时候我很快就明白了。这些上了年纪的建筑物还真的是工厂的一部分，那些工厂在19世纪，甚至是20世纪初的时候说不定还非常活跃。在那个时候，整个伍珀河流域都是重要的工业区。这里大多数的工业都是纺织厂。这些村庄都是那些工厂建的，在纺织工厂工作的工人和他们的家人们就把这些村庄当作是自己的家。那些铁路在当时说不定就是用来运输原材料和工厂制造出来的成品的。而现在，这些工业都已经废弃了。那些住在村里的村民们如今也不在那些工厂里工作了，他们现在可以享受宁静的伍珀河和周围的自然风光。不过，他们的父辈或者是祖辈说不都能记得之前的日子——日夜不停工作的机械发出巨大的声响，滚滚黑烟从高耸的烟囱里面冒出来。那是一个疯狂的时代。"
      }
    },
    {
      "type": "ImageBlock",
      "url": "https://live.staticflickr.com/65535/52484578131_949521eb2b_k_d.jpg",
      "description": {
        "en": "The calm Wupper",
        "zh": "宁静的伍珀河"
      }
    },
    {
      "type": "ImageBlock",
      "url": "https://live.staticflickr.com/65535/52484848334_39be89e4eb_k_d.jpg",
      "description": {
        "en": "The calm Wupper",
        "zh": "宁静的伍珀河"
      }
    },
    {
      "type": "ImageBlock",
      "url": "https://live.staticflickr.com/65535/52484091642_3e1197d961_k_d.jpg",
      "description": {
        "en": "The calm Wupper",
        "zh": "宁静的伍珀河"
      }
    },
    {
      "type": "ImageBlock",
      "url": "https://live.staticflickr.com/65535/52485135038_aec43b3d73_k_d.jpg",
      "description": {
        "en": "The tree is eating the rocks",
        "zh": "树木正在把大块大块的石头吞到肚子里"
      }
    },
    {
      "type": "ImageBlock",
      "url": "https://live.staticflickr.com/65535/52484588666_06a3ba3981_k_d.jpg",
      "description": {
        "en": "The cave adventure for our tiny friends in the forest",
        "zh": "树林里的小伙伴们的洞窟探险"
      }
    },
    {
      "type": "ImageBlock",
      "url": "https://live.staticflickr.com/65535/52485048440_1c9aff0762_k_d.jpg",
      "description": {
        "en": "The trail goes along the Wupper",
        "zh": "小路沿着伍珀河向前延伸"
      }
    },
    {
      "type": "ImageBlock",
      "url": "https://live.staticflickr.com/65535/52484858399_e0e8b27c91_k_d.jpg",
      "description": {
        "en": "Railway",
        "zh": "铁路"
      }
    },
    {
      "type": "ImageBlock",
      "url": "https://live.staticflickr.com/65535/52484587776_1c7299b759_k_d.jpg",
      "description": {
        "en": "Nuts and nuts",
        "zh": "螺钉与坚果"
      }
    },
    {
      "type": "ImageBlock",
      "url": "https://live.staticflickr.com/65535/52487200360_1b6c144747_k_d.jpg",
      "description": {
        "en": "The building probably belongs to an old textile manufacturer",
        "zh": "这栋建筑物说不定以前是一座纺织厂的一部分"
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "Following the trail, accompanied by Wupper and the railway, soon I reached a small town. There was an abandoned railway station connected to the railway that I had followed all the way down. If it was not the moos and the rust, the time seems to be frozen there. The old steam locomotive and carriage were still lying on the rail, covered by rust. It's really hard not to take photo seeing this.",
        "zh": "跟着小路，有伍珀河和铁路相伴，我很快地来到了一座小镇。那里有一座废弃的火车站，与之前一直伴随我左右的那条铁路是相连接的。要不是苔藓和锈迹，这里就像是时间静止了一样。老式的蒸汽机车车头和车厢就在铁轨上静静地躺着，全身布满了锈迹。看到了这样的景象，我是很难不拍几张照片的。"
      }
    },
    {
      "type": "ImageBlock",
      "url": "https://live.staticflickr.com/65535/52487200220_dd23989654_k_d.jpg",
      "description": {
        "en": "Age doesn't matter, just be different, be yourself",
        "zh": "年龄什么的都不是问题，只要与众不同，做好自己就可以了"
      }
    },
    {
      "type": "ImageBlock",
      "url": "https://live.staticflickr.com/65535/52486289272_8eb2e9748c_k_d.jpg",
      "description": {
        "en": "The old steam locomotive",
        "zh": "老旧的蒸汽火车头"
      }
    },
    {
      "type": "ImageBlock",
      "url": "https://live.staticflickr.com/65535/52487253295_50ef741d1a_k_d.jpg",
      "description": {
        "en": "The old steam locomotive",
        "zh": "老旧的蒸汽火车头"
      }
    },
    {
      "type": "ImageBlock",
      "url": "https://live.staticflickr.com/65535/52487064459_b61c4a71b5_k_d.jpg",
      "description": {
        "en": "The old steam locomotive",
        "zh": "老旧的蒸汽火车头"
      }
    },
    {
      "type": "ImageBlock",
      "url": "https://live.staticflickr.com/65535/52486288807_11c39d917b_k_d.jpg",
      "description": {
        "en": "The old steam locomotive",
        "zh": "老旧的蒸汽火车头"
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "The highest point of the trail was Wülfing Museum, which locates in one of the \"factory villages\". It was a textile manufacturer, and abandoned long time ago. Later it has been renovated, and nowadays, it is a museum about the memories of that industrial era.",
        "zh": "整段徒步路线的高潮部分应该要算是维尔芬博物馆了。它坐落在一个“工厂村”里面。以前它是一座纺织厂，很久以前被废弃了。后来人们把它翻修了一番，现在它是一座展示当年工业时代的风貌的博物馆。"
      }
    },
    {
      "type": "ImageBlock",
      "url": "https://live.staticflickr.com/65535/52487419918_aaee27a96c_k_d.jpg",
      "description": {
        "en": "Those windows used to belong to the homes of those workers in the textile manufacturer",
        "zh": "这些都是以前在纺织厂里工作的工人的家的窗户"
      }
    },
    {
      "type": "ImageBlock",
      "url": "https://live.staticflickr.com/65535/52487046051_70b2e8d5aa_k_d.jpg",
      "description": {
        "en": "One of the pistons of the steam machine",
        "zh": "蒸汽机的其中一个汽缸"
      }
    },
    {
      "type": "ImageBlock",
      "url": "https://live.staticflickr.com/65535/52486548642_952b1919d5_k_d.jpg",
      "description": {
        "en": "Mechanical details of the steam machine",
        "zh": "蒸汽机的机械细节"
      }
    },
    {
      "type": "ImageBlock",
      "url": "https://live.staticflickr.com/65535/52487593738_e138e3b76c_k_d.jpg",
      "description": {
        "en": "Mechanical RPM regulator",
        "zh": "纯机械的转速控制器"
      }
    },
    {
      "type": "ImageBlock",
      "url": "https://live.staticflickr.com/65535/52486548277_e85f3e12b4_k_d.jpg",
      "description": {
        "en": "Mechanical details of the steam machine",
        "zh": "蒸汽机的机械细节"
      }
    },
    {
      "type": "ImageBlock",
      "url": "https://live.staticflickr.com/65535/52487512970_f86eaf30dd_k_d.jpg",
      "description": {
        "en": "The huge steam machine is filling up a whole room",
        "zh": "巨大的蒸汽机占满了一整个房间"
      }
    },
    {
      "type": "ImageBlock",
      "url": "https://live.staticflickr.com/65535/52487512870_d96526523b_k_d.jpg",
      "description": {
        "en": "The giant flywheel",
        "zh": "巨大的飞轮"
      }
    },
    {
      "type": "ImageBlock",
      "url": "https://live.staticflickr.com/65535/52487045091_bba35aed7e_k_d.jpg",
      "description": {
        "en": "Engine oil reservoir",
        "zh": "机油储罐"
      }
    },
    {
      "type": "ImageBlock",
      "url": "https://live.staticflickr.com/65535/52487592853_9037d294d6_k_d.jpg",
      "description": {
        "en": "Engine oil dripping into the machine",
        "zh": "机油滴进机器里"
      }
    },
    {
      "type": "ImageBlock",
      "url": "https://live.staticflickr.com/65535/52487325104_9a376b6e60_k_d.jpg",
      "description": {
        "en": "Mechanical details of the steam machine",
        "zh": "蒸汽机的机械细节"
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "To be honest, I didn't pay too much attention to the history of the factory, but I had been deeply attracted by the huge machines in the museum. There is the biggest steam machine in that area, which takes a whole room, and the flywheel alone is three times taller than a person. I love all the mechanical details of the machine, and I spent a lot of time taking photos for this huge beast. The loom was very interesting too, actually the cloth weaving process itself was already fascinating enough. The usage of punched cards for controlling the pattern on the cloth was also astonishing. Imagine that long before the PCs getting popular, people already started to use punched card to handle a huge pile of cast irons. Isn't it a mechanical computer to some extent?",
        "zh": "实话说我没太用心去了解工厂的历史，不过我被博物馆里巨大的机械给深深吸引了。展品里面有贝吉舍斯兰现存的最大的蒸汽机，它占了足足一整个房间。光是飞轮的直径就有三个人多高了。我特别喜欢这台机器的不同细节部分，也花了好长时间给这台钢铁巨兽照了好多照片。织布机也很有趣，其实光是织布的那个过程就够吸引人的了。那些织布机在用打孔卡控制织布的花纹也是令人惊叹不已。想象一下，在个人电脑流行开来之前的很长很长时间里，人们已经开始用打孔卡来控制这堆巨大的铸铁零件了。这从某种程度上来说，不就是一台纯机械的计算机了么？"
      }
    },
    {
      "type": "ImageBlock",
      "url": "https://live.staticflickr.com/65535/52486547552_0fbe5e5e9b_k_d.jpg",
      "description": {
        "en": "Guages for a generator",
        "zh": "发电机的各种仪表盘"
      }
    },
    {
      "type": "ImageBlock",
      "url": "https://live.staticflickr.com/65535/52487044736_bea8803387_k_d.jpg",
      "description": {
        "en": "The rotor of an ancient generator",
        "zh": "一台古老的发电机的转子"
      }
    },
    {
      "type": "ImageBlock",
      "url": "https://live.staticflickr.com/65535/52487324839_0d46e20d63_k_d.jpg",
      "description": {
        "en": "The brush of an ancient generator",
        "zh": "一台古老的发电机的电刷"
      }
    },
    {
      "type": "ImageBlock",
      "url": "https://live.staticflickr.com/65535/52487592513_542e0bc752_k_d.jpg",
      "description": {
        "en": "Not yet finished cloth",
        "zh": "还没有织完的布"
      }
    },
    {
      "type": "ImageBlock",
      "url": "https://live.staticflickr.com/65535/52487511770_2409c3f707_k_d.jpg",
      "description": {
        "en": "Punched card for an ancient \"mechanical computer\"",
        "zh": "一台古老的“机械式计算机”的打孔卡"
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "Although the details of the machine itself is fascinating, I'd say the relationship between machine and human-beings exhibited in the museum were not that optimistic. If all those mechines in the museum started to work, all the people would be drown in the huge noises created by the machines day and night. Plus, people had to work longer than we do now, without proper protection against the polluted air or electricity. They had to get very close to the running machine to do the maintanance work, and there was a sign saying, \"even if the shaft is smooth, your cloths can be winded into it\", which covers everything in a darkness. If one wasn't careful enough, he/she will find his/her fingers stuck between two gears, or even lost his/her life there. Even if they managed to survive the machines and the polluted air, the depressing atomsphere in the building would drive people crazy. That era has left some aesthetic relics; however, talking about going back to that era, I'm afraid I have to say no.",
        "zh": "虽然机械的细节本身非常吸引人，但是博物馆展出的人与机器的关系却并没有那么乐观。如果博物馆里所有的机器同时开始运转的话，所有的人很快就会被机器日夜运转产生的巨大噪音所淹没。另外，那个时候的人每天的工作时间比现在的人要长的多了，而且他们还没有任何保护措施，能让他们免于污浊的空气或者是高压电的伤害。他们还得跑到离巨大的机械非常近的地方去做一些维护的工作，在机器旁边有一个标语，上面写着：“就算是轴看起来很光滑，它也会把你的衣服卷进去”。这顿时给所有的事物笼罩上了一层阴影。如果有人不够小心的话，他/她可能很快就会发现，他/她断掉的手指头卡在两个大齿轮中间，甚至是干脆丢掉性命。就算他们没被那些巨大的机械带走，而且又没被污浊的空气给毒死，建筑物里那种压抑的氛围也绝对会把人给逼疯。那个时代确实留下了不少具有美感的古董，不过，要说回到那个时代的话，我看还是算了吧。"
      }
    },
    {
      "type": "ImageBlock",
      "url": "https://live.staticflickr.com/65535/52487512000_46acde51a1_k_d.jpg",
      "description": {
        "en": "Number of cloths finished today? Or number of fingers being cut? Or number of lives being taken?",
        "zh": "今天织完的布匹的数量？还是机器吃掉的手指头的数量？还是机器卷走的人命的数量？"
      }
    },
    {
      "type": "ImageBlock",
      "url": "https://live.staticflickr.com/65535/52487592078_e5457ff9da_k_d.jpg",
      "description": {
        "en": "Even if one survives the huge machines, and the polluted air, does he/she able to survive the depression?",
        "zh": "即便是人没被巨大的机械卷走，没有被污浊的空气给毒死，他/她能受得了这种抑郁之感吗？"
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "I spent too much time in the museum. The day was already dark when I got out of the building. I had to walk very fast to get to the point where I turned back in the last day, and almost jogging back to the place where I had parked my car. It was completely dark when I got back to my car. I was in a good mood all the way back home, because the first short-distance hiking trail was finished!",
        "zh": "我在博物馆里呆了太长时间了。当我从建筑物里面出来的时候，天色已经很黑了。我一路快走，终于到了我前一天折返的地方。紧接着我几乎是以一路小跑的速度跑回了我早晨停车的地方。当我赶到我停车的地方的时候，天已经完全黑了。回家的一路上我的心情都非常好，因为我完成了第一条短途徒步路线了！"
      }
    }
  ]
}