{
  "title": {
    "en": "About",
    "de": "Über",
    "zh": "关于"
  },
  "time": {
    "date": "2022-09-04",
    "time": "18:41:00",
    "timeZone": "Europe/Berlin"
  },
  "location": {
    "name": {
      "en": "Home",
      "de": "Zuhause",
      "zh": "家中"
    }
  },
  "blocks": [
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "Ok, now you are reading this webpage. This is crazy! There is such a huge amount data flying over the whole Internet, and you have found my blog, while this is already one thing, and then you have started reading the \"About\" page of my blog, which is another thing completely on a different level."
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "Well, anyways, welcome to my blog!"
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "This blog is all about _time_."
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "But what is _time_? It might be the ticks from a clock on the wall, or the oscillation of a quartz crystal, or even the radiation generated by the electron transition of the caesium 133 atom. But these are all mechanic, these are all artificially invented or defined for meassurement of the time. However, we all know the concept of time even before there is any clock on the wall. So the question is rather, what is _time to me_?"
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "For me, the time is the interaction between changes, observations and memories."
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "Imagine a world without any alternation, transformation, or without any change, which means there will be no days and nights, no river flowing, no leaves turning yellow and green, no aging, everything stays the same forever. I believe in such a world I won't be able to understand the concept of time. In such a world, I couldn't even think, because thinking is also a sort of change happens in my head. Thus change must be a necessary element of time."
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "What about observation then? What if I stay in a dark room forever? Although the world is spinning like crazy everyday, but only outside of the room, not for me. I can't see any changes of the world, thus the changes outside of the room, those days, nights, months and years wouldn't make any sense to me. In this case, I still won't understand what is time."
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "But if there are changes, and I can sense those changes, does it mean that I will know what is time? Well, I think not really. Because I have to know a chain of changes to be able to get the concept of time. If I don't remember what has happened, everything for me is just completely new and separated and independent. They just happens. Since I don't remember anything, I won't know any connection between them, I won't even know the current change is happening after another. They are just a set of random phenomena, instead of a constant stream which can help me to understand the term \"time\"."
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "Once there is something changing, and I can recognize it, and then I can remember it, and then another change that I can recognize too, and so on so forth, only so I'll be able to chain those changes together in my head, form a constant stream of changes, and then the illustration of \"time flies\" will finally get clear."
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "And this blog is all about _time_. It is all about the interaction between changes, observations and memories."
      }
    }
  ]
}
