{
  "title": {
    "en": "About",
    "de": "Über",
    "zh": "关于"
  },
  "time": {
    "date": "2022-09-04",
    "time": "18:41:00",
    "timeZone": "Europe/Berlin"
  },
  "location": {
    "name": {
      "en": "Home",
      "de": "Zuhause",
      "zh": "家中"
    }
  },
  "blocks": [
    {
      "type": "HeadingBlock",
      "level": 1,
      "text": {
        "en": "About... Time?",
        "zh": "关于……时间？"
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "Ok, now you are reading this webpage. This is crazy! There is such a huge amount data flying over the whole Internet, and you have found my blog, while this is already one thing, and then you have started reading the \"About\" page of my blog, which is another thing completely on a different level.",
        "zh": "太神奇了！我还从来没想过有人会看这个网页。网上每天有海量的信息飞来飞去，可是你确偏偏发现了我的博客。不过发现了我的博客还不算稀奇，关键是你还开始看我写的这篇“关于”来了。你说这是不是一种缘分？"
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "Well, anyways, welcome to my blog!",
        "zh": "不管怎样，欢迎到我的博客来做客！"
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "This blog is all about _time_.",
        "zh": "这个博客里面的内容都是跟**时间**有关的……"
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "But what is _time_? It might be the ticks from a clock on the wall, or the oscillation of a quartz crystal, or even the radiation generated by the electron transition of the caesium 133 atom. But these are all mechanic, these are all artificially invented or defined for meassurement of the time. However, we all know the concept of time even before there is any clock on the wall. So the question is rather, what is _time to me_?",
        "zh": "不过这个**时间**究竟是个什么东西呢？时间可以是墙上的时钟发出的滴答声，或者是石英晶体的振动，甚至可以是铯133原子的电子跃迁产生的辐射。不过这些也太机械了，它们无非都是人类创造或者定义出来的，用来计时的技术罢了。而我们根本不需要什么挂钟就可以体会到时间的存在。所以这个问题更好的问法恐怕应该是“**时间对我来说**是什么”。"
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "For me, the time is the interaction between changes, observations and memories.",
        "zh": "对我来说，时间是变化、观察与记忆相互作用的产物。"
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "Imagine a world without any alternation, transformation, or without any change, which means there will be no days and nights, no river flowing, no leaves turning yellow and green, no aging, everything stays the same forever. I believe in such a world I won't be able to understand the concept of time. In such a world, I couldn't even think, because thinking is also a sort of change that happens in my head. Thus change must be a necessary element of time.",
        "zh": "想象一下，如果世界上没有任何变化，也就是说没有什么白天和黑夜、河水不再流淌、树叶不会变绿变黄、没有什么衰老，所有的事物都是永久地一成不变。我觉得我在一个这样的世界里绝对不会理解时间的概念的。其实在这样的世界里，我连思考都做不到，毕竟思考也是一种变化，是我的脑袋里发生的变化而已。这样一来，变化就是时间的一个必要的元素。"
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "What about observation then? What if I stay in a dark room forever? Although the world is spinning like crazy everyday, but only outside of the room, not for me. I can't observe any changes in the world, thus the changes outside of the room, those days, nights, months and years wouldn't make any sense to me. In this case, I still won't understand what is time. It seems that observation is just another key of understanding time.",
        "zh": "那么观察又作何解呢？如果我一辈子都呆在一个小黑屋里会怎样？虽然世界一刻不停地在疯狂旋转着，但是那也只是屋外的世界，对我来说可不是这样。我没法观察世界的变化，也就是说哪些白天、黑夜、年月更替，对我来说都没有任何意义。这样一来，我还是没法理解什么是时间。所以看来观察也是理解时间的另外一个关键因素。"
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "But if there are changes, and I can observe those changes, does it mean that I will understand what time is? Well, I think not really. Because I have to recognize a chain of changes to be able to get the concept of time. If I don't remember what has happened, everything for me is just completely new and separated and independent. They just happens. Since I don't remember anything, I won't know any connection between them, I won't even know the current change is happening after another. They are just a set of random phenomena, instead of a constant stream which can help me to understand the term \"time\". And memory, just like what have been discussed before, is one of the necessary building blocks of the recognition of the constant stream of changes, thus also necessary for understanding time.",
        "zh": "如果有了变化，我又能观察到这些变化，这就意味着我能理解什么是时间了吗？也不尽然。因为我必须要认知到一连串的变化，才有可能理解时间的概念。如果我都不记得发生过什么，那么所有的事情对我来说就都是新的、相互独立分离的。我会觉得世界上一直都有事情在发生而已。因为我没法记住任何事情，我也不可能理解到事情之间的联系，我甚至都不知道当下我正在观察的变化发生在另外一个变化之后。所有的变化都是一组随机的现象，而不会形成一个持续的变化流，而只有变化形成了一连串的变化流之后才能让我理解时间的含义。至于记忆嘛，如前所述，它是形成对这种变化流的认知的必要因素，同时也就成了理解时间的必要因素了。"
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "Once there is something changing, and I can recognize it, and then I can remember it, and then another change that I can recognize too, and so on so forth, only so I'll be able to chain those changes together in my head, form a constant stream of changes, and then the illustration of \"time flies\" will naturally get clear.",
        "zh": "一旦有了变化，我又能认知到，然后我又能记住，然后又来另外一个变化，又被我认知到，如此往复……只有这样，我才能把所有这些变化在我的脑子里串起来，形成一个持续的变化流。然后那种”时间飞逝“的景象也就自然地浮现在我的脑海中了。"
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "And about this blog, it is all about _time_, it is all about the interaction between changes, observations and memories.",
        "zh": "而这个博客呢，它里面的内容都是跟**时间**有关的，它们都是变化、观察与记忆相互作用的产物。"
      }
    },
    {
      "type": "HeadingBlock",
      "level": 1,
      "text": {
        "en": "About the Author",
        "zh": "关于作者"
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "The author of this blog is myself, Watermelon Puppet. Of course it is a nickname. I prefer to keep my real name a secret though.",
        "zh": "这个博客的作者就是我本人——西瓜玩偶。这个当然是网名了，本名保密。"
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "I'm sort of introverted. If you know me in person, you could find me talking quite a lot, but this is only on the surface. I actually need time for myself very often. Keeping talking with people will drain my energy very quickly. Besides, comparing to talking, I prefer writing. Since I believe the natural language is very inefficient and anbigious. In talking I tend to make a lot mistakes, say something that is not what I meant to say. However if everything is written down, then I can always review and modify it before I publish or send it. It is much more efficent and accurate than keeping explaining myself in a flow.",
        "zh": "我应该算是一个内向的人吧。如果你在现实中认识我的话，你可能会觉得我很能说话，不过这只是表象。我很经常地会需要一些留给我自己一个人的时间。一直跟人说话的话，很快我的能量就会被耗尽了。除此之外，比起说话，我其实更喜欢写东西。因为我总觉得自然语言非常低效率，而且充满歧义。我说话的时候经常会犯错误，随口说出一些话完全不能表达我想要表达的意思。如果我把这些东西写下来的话，那么在发表或者是发送之前我总会有机会检查一遍，改掉一些小地方。比起在交谈中一直解释我的意思，写文字不仅更高效、也更精确得多了。"
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "I have a bunch of hobbies, but among them, I like travelling, painting, fixing things (especially my car) and photography the most. And each of them is a reflection of one aspect of my character.",
        "zh": "我有不少兴趣，不过其中我自己最喜欢的还是旅行、画画、修理各种事物（尤其是车子）、摄影。这些兴趣每一样都是我的性格的一种自然反映。"
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "I'm curious, like to know new things. I'm especially being attracted by nature. I love to see different terrain, different vegetation, and I love those wild lives. I'm also interested in getting to know different cultures. Thus I like travelling, especially the travelling styles where I have to really put my own effort in, like hiking, road-trip, and so on.",
        "zh": "我是个很好奇的人，喜欢接触新鲜的事物。我非常喜欢自然，特别喜欢看不同的地形、地貌和植被，特别喜欢野生动物，也喜欢了解不同的文化。所以我喜欢旅行，尤其是那些身体力行的旅行方式，比如说徒步、自驾什么的。"
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "I have a lot of weird ideas, so I eagerly want to have an outlet of my creativity. For this reason I've tried a lot of activities: writing lacks impact, music is too abstract, making games requires too much time, effort and knowledge. The only possibility left is painting, which is by far the best way to express myself.",
        "zh": "我有不少怪诞的想法，所以我总是非常迫切地需要一个创造力的宣泄口。为此我尝试过不少创造力的发泄方式：写作太缺少冲击力，音乐太抽象，做游戏则需要相当多的时间、精力与知识。所以我喜欢画画，我觉得这恐怕是最适合我的创作方式了。"
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "Regarding fixing things, I’m always seeking for some unrealistic \"eternity\". If I like something, I really want to live with it for the whole life. However the only thing that can't be changed is that everything is changing. The best compromise would be change things by myself in a good way, thus I like fixing things. Lawn, furnitures, electronic gadges and cars, I've fixed all of them. And since I love road-trip, car is naturally becoming the favourite object that I'd like to fix.",
        "zh": "至于修修补补的原因嘛，我对“永恒”似乎有一些不切实际的追求。如果我喜欢什么东西，我真的就希望能用这个东西用到老。然而事物却总是在变化的，这是不可抗拒的自然力量。最好的折衷方案恐怕就是靠自己的努力不断地把事物往好的方向改变，所以我喜欢修理各种各样的东西。从草坪到家具到电器到车子我都修过。而我又喜欢自驾旅行，所以车子就很自然地成了我最喜欢修的东西之一。"
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "Last but not least, I like to record my life. I've took a lot of photos with my smartphone before, and also have written some travelling diaries with pen on paper. Each time I go back to see those photos and read those diaries, I'm always filled with thousands of different emotions. For this reason, I like photography, it is the easiest way to record my life. Out of the same reason, I've started this blog. Besides, with photography in mind, whereever I go, I'll try to keep an eye on anything that is beautiful. As a result, I've found a lot of beautiful details in my life, which will never be noticed without photography. The same effect is also coming from writting a blog. It motivates me to do more meaningful stuff, instead of always falling into the daily routine. Recording and living, they are catalyzing each other.",
        "zh": "最后，我喜欢记录我的生活，之前我经常用手机拍一些旅游照片，也手写过一些游记，每当我回头去翻看那些照片，读那些手写的游记的时候，我都会有一种非常充实、并且感慨万千的感觉。所以我喜欢摄影，它是记录我的生活最最简便易行的方式。同样也是出于这个原因，我搞了这么一个博客。除此之外，如果我心里想着摄影的话，不管我去哪里，我都会试着寻找身边的那些美丽的小东西。这样一来，我还真的就发现了好多生活中美丽的小细节。如果我不摄影的话，我是永远不可能发现这些东西的。同样，写博客也起到了类似的效果，它让我更有动力去做一些有意义的事情，而不是日复一日地遵循一个固定的套路去生活。记录生活与生活本身，它们真的是在相互促进的。"
      }
    }
  ]
}
