{
  "title": {
    "en": "Altenberg Church",
    "zh": "Altenberg教堂"
  },
  "time": {
    "date": "2022-07-17",
    "time": "18:34:00",
    "timeZone": "Europe/Berlin"
  },
  "location": {
    "name": {
      "en": "Altenberg",
      "zh": "Altenberg"
    },
    "coord": {
      "lat": 51.055016,
      "long": 7.133283
    }
  },
  "thumbnailImageUrl": "https://live.staticflickr.com/65535/52232446434_afbed53255_k_d.jpg",
  "excerpt": {
    "en": "Altenberg Church is not just a beautiful church. Actually, it is also the rest place where quite a few Counts and Dukes of Bergisches Land were buried, and it seems to be quite famous among tourists too. However, I don't really like the vibe there.",
    "zh": "阿尔滕贝格教堂不仅仅是一座漂亮的教堂而已。事实上，它是好几代贝吉舍斯兰大公的安息之所。而且它好像在游客间也算有些名气。不过我并不是太喜欢这里的感觉。"
  },
  "blocks": [
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "Recently, I always read Google Maps while having dinner, so that I could know which places around me are worth visiting. In this case, I don't have to decide where to go before I jump into my car any more.",
        "zh": "最近几天，我经常会在吃晚饭的时候一边吃一边看Google地图，主要是为了解周围有哪些漂亮的景色值得一看。这样一来，周六周日出门之前我就不用现查要去哪里了，直接跳上车，说走就走。"
      }
    },
    {
      "type": "ImageBlock",
      "url": "https://live.staticflickr.com/65535/52232446434_afbed53255_k_d.jpg",
      "description": {
        "en": "Altenberg Church",
        "zh": "Altenberg教堂"
      }
    },
    {
      "type": "ImageBlock",
      "url": "https://live.staticflickr.com/65535/52232656160_e43a97ee95_k_d.jpg",
      "description": {
        "en": "Altenberg Church",
        "zh": "Altenberg教堂"
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "I was planing to go to Altenberg this time. By writing Altenberg I mean the small village near Odenthal, east to Leverkusen, and north to Bergisches Gladbach. I didn't know anything about this place before, I hadn't even heard the name of the village. I decided to go there, only becuase I saw some beautiful pictures of the church there in Google Maps.",
        "zh": "我这次计划去阿尔滕贝格（Altenberg）。我说的这个阿尔滕贝格是奥登塔尔（Odenthal）旁边的一个小村子，在勒沃库森的东边，贝吉舍—格拉德巴赫的北边。我之所以决定去哪里，纯粹是因为我在Google地图上看到了那里的教堂照片很漂亮而已。之前我从来没了解过这个村子，甚至连这个村子的名字都没听说过。"
      }
    },
    {
      "type": "ImageBlock",
      "url": "https://live.staticflickr.com/65535/52232447414_f030439f53_k_d.jpg",
      "description": {
        "en": "Altenberg Church",
        "zh": "Altenberg教堂"
      }
    },
    {
      "type": "ImageBlock",
      "url": "https://live.staticflickr.com/65535/52232447249_30f0b0ee35_k_d.jpg",
      "description": {
        "en": "Altenberg Church",
        "zh": "Altenberg教堂"
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "The pictures of the church on Google Maps are not lying, it was indeed a beautiful church, quite huge, and it has some fantastic glass windows, the sculptures on the stone walls look great too. I reached there very late. Otherwise I'd go in and take some pictures of the glass windows from inside.",
        "zh": "Google地图上的照片确实没有骗人，它确实是一座漂亮的教堂，规模还蛮大的。它有几扇琉璃窗非常好看，石墙上的雕塑也非常精美。我到那里的时间已经是非常晚了，不然的话我可能会进去，从里面拍几张琉璃窗的照片。"
      }
    },
    {
      "type": "ImageBlock",
      "url": "https://live.staticflickr.com/65535/52231177082_755517bb2f_k_d.jpg",
      "description": {
        "en": "Altenberg Church",
        "zh": "Altenberg教堂"
      }
    },
    {
      "type": "ImageBlock",
      "url": "https://live.staticflickr.com/65535/52232446784_9d012179df_k_d.jpg",
      "description": {
        "en": "Altenberg Church",
        "zh": "Altenberg教堂"
      }
    },
    {
      "type": "ImageBlock",
      "url": "https://live.staticflickr.com/65535/52232655655_ab52972d3e_k_d.jpg",
      "description": {
        "en": "Altenberg Church",
        "zh": "Altenberg教堂"
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "And it is not just a beautiful church. Actually it is also the rest place where quite a few Counts and Dukes of Bergisches Land were buried, and it seems to be quite famous among tourists too. However, I don't really like the vibe there. It was really like a well-made place to provide the most relaxing vacation experiences. Everything looks like designed, and they really pops out, instead of just being there, blending into the environment. So I didn't stay there for a long time. After a few pictures of the church itself, I just left.",
        "zh": "它也不仅仅是一座漂亮的教堂而已。事实上，它是好几代贝吉舍斯兰大公的安息之所。而且它好像在游客间也算有些名气。不过我并不是太喜欢这里的感觉。因为它有点像是一个精心制造出来的地方，好给人们提供最轻松愉快的度假经历。所有的事物都像是静心设计过的，而且都显得非常突兀，而不是让人感觉它本来就应该在那里，与周围的环境融为一体。所以我没有在那里呆很长时间。简单地给教堂照了几张照片之后，我就离开了。"
      }
    }
  ]
}