{
  "title": {
    "en": "Marathon Run & First Impressions of Cologne",
    "zh": "马拉松与科隆的第一印象"
  },
  "time": {
    "date": "2022-10-02",
    "time": "09:05:00",
    "timeZone": "Europe/Berlin"
  },
  "location": {
    "name": {
      "en": "Deutz, Cologne",
      "de": "Deutz, Köln",
      "zh": "科隆，多伊茨"
    },
    "coord": {
      "lat": "50.93984",
      "long": "6.97551"
    }
  },
  "blocks": [
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "About 2 months ago, one of my colleagues was talking about taking part in the relay of the Cologne Marathon in the off-topic channel. She was a fitness trainer before, and she used to take part in the Half-Marathon race, and the medals that she has collected are filling up a whole drawer. Actually I didn't plan to attend at the beginning, because long distance running is probably the sport type that I'm least good at. But she asked in the channel again, and mentioned that there is one of the stages that is only 6 km long. Since I had run about 3.5 km before, training to 6 km wouldn't be that difficult. I always wanted to challenge myself and push my limit by doing something that I'm not good at or have never done before. With that in my mind, I said that I would like to take part in.",
        "zh": "大概是两个月之前吧，我的一个同事在公司的闲聊群里面说想要参加科隆的马拉松接力跑。她之前是一个健身教练，经常参加半程马拉松比赛，她的参加马拉松跑步的纪念章都堆满了半个抽屉了。我一开始的时候本来没准备参加的，毕竟对我来说，最糟糕的运动项目可能就是长跑了。不过她后来又在群里问了一遍，而且还提到有一段只有6公里。我想我以前跑过的最长的路程大概有3.5公里左右吧，想要练到6公里应该不是什么难事。我一直想要挑战我自己的极限，做一些自己以前不擅长或者是完全没做过的事情。这么想着，我也就跟同事说我会参加了。"
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "However, there is another runner in my group, who would take the 6 km stage, which means I had to take the 11.5 km stage, namely the second easiest stage. Although this was basically trippling or even quadrupling the longest distance that I had ever run so far, I told them that I would still give it a try. If I could manage to train up to 11.5 km, I would join the run. Actually it almost worked out, one time I managed to do 10.8 km, only 700 meter less than the expected distance. Therefore I thought it wouldn't be a big problem to run the 11.5 km stage, so I told them just count me in.",
        "zh": "不过，我这一组里面有另外一个人，她想要跑6公里的那一段，也就是说如果我要参加的话，我就必须要去跑11.5公里的那一段，也就是第二简单的一段。虽然这个比我之前跑过的最长的路程还翻了三番甚至是四番，我还是跟他们说我想试一试。如果我能练到跑下来11.5公里的话，我还是会参加跑步的。其实我也几乎练到了哪个程度了，有一次我一口气跑了10.8公里，比我需要跑的路程只少了700米。所以我想到时候要跑11.5公里的那一段应该也不是什么太大的问题吧，所以我跟他们说了，干脆算上我一个。"
      }
    },
    {
      "type": "ImageBlock",
      "url": "/images/2022-10-02--start-point-of-marathon.jpg",
      "description": {
        "en": "Start point of the Cologn Marathon",
        "zh": "科隆马拉松比赛的起点"
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "However, training is just training, I was still quite nervous before the actual race. Who knows what could happen there? For a better preparation, I had a decent breakfast, and reached the meeting point quite early. My colleagues and I prepared the number plate and so on shortly before the race started. We cheered up the runners running the first stage, and then slowly walking to the first transition point.",
        "zh": "不过，训练归训练，在真正的比赛之前，我还是相当紧张的。谁知道在真正跑起来之后会有什么事情发生呢？为了准备得更充分一点，我吃了一顿很丰盛得早饭，早早地就到了碰头得地方。我跟我的同事们准备好了号码牌什么的，很快，正式的比赛就开始了。我们给跑第一段的跑者们加了油，然后慢慢地就往第一个交接区走。"
      }
    },
    {
      "type": "ImageBlock",
      "url": "/images/2022-10-02--people-in-marathon-run.jpg",
      "description": {
        "en": "The Marathon runners",
        "zh": "参加马拉松的跑者"
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "I arrived at the first transition point about 1 hour before the first runner in our group reached there, and warmed myself up quite well. Then it was my turn. I was a little bit hyped up after the transition, and started too fast at the beginning. After about 2 to 3 kilometers, I noticed that this wasn't going to work. Therefore I slowed down a little bit, and the slowed down again, and then again... Soon I felt that I couldn't run any longer, so I started walking.",
        "zh": "我到了第一个交接区之后就开始热身，大概过了一个小时左右，我们组的第一个跑者就到了。接下来轮到我了。我在刚刚交接完的时候稍微有点点兴奋过头，一开始的时候跑得太快了。大概2到3公里左右之后，我开始意识到按照这个速度下去肯定行不通的。于是我开始放慢速度，后来又放慢一点点速度，后来又再放慢了一点点速度……很快就我就觉得我完全跑不下去了，所以我干脆就开始走。"
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "Despite the fact that the running was super exhausting, I cannot say that I wasn't enjoying it. There were a lot of people, either the runners or the crowd along the street, cheering me up. And I saw lot of different runners, the elder, the young, the runner dressed up like an indian chief, the bare feets (which were running faster than me), the one in the wheel chairs (which were still faster than me)... I ran and walked alternately, but tried my best to walk as little as possible. Finally, after almost 1 hour and 40 minutes, I saw the second transition point, and my colleagues were waiting there, cheering me up. I hand over the belt to the next runner in our group. Whoohooo! I finished it! Although I walked about one-third of the 11.5 kilometers, I still took this as an achievement of my life. You should know that I'm not good at running at all, and have never run such a distance before, and now I've finished the 11.5 kilometers! The speed is not important at all, instead, taking part in and finishing my stage are the most important part of the Marathon relay.",
        "zh": "虽然我跑的这一段相当吃力，但是我也挺享受跑步的过程的。因为有好多人——包括其他的跑者，还有街边的人群——都在给我加油。我还看到了各种各样的跑者，有老人、有年轻人，有穿得像个印第安酋长一样的跑者，有赤脚跑步的（跑得比我还快），还有坐轮椅跑的（跑得还是比我快）……我则是跑步和走路交替，但是同时也是尽量地缩短走路的时间。终于，大概过了有1个小时40分钟吧，我看到了第二个交接区。同事们早就等在那里给我加油了，我把腰带交给了我们组里的下一个跑者。太棒了！我终于跑完了！虽然我走路走了大概有11.5公里的三分之一吧，不过我还是觉得这是我人生中的一个成就。要知道我是非常不擅长跑步的，而且我之前也从来没有跑过这么长，然而我现在跑完了11.5公里了！速度不是最重要的，我参与了，而且还完成了我跑的这一段，这才是参加马拉松接力跑的精髓所在！"
      }
    },
    {
      "type": "ImageBlock",
      "url": "/images/2022-10-02--crowd-before-the-finishing-line.jpg",
      "description": {
        "en": "The crowd before the finishing line",
        "zh": "终点线之前的人群"
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "Since my colleagues were all faster than I did, we didn't wait for long until the next runner in our group reached the third transition point. After the transition, we all went to the finishing line. There was a huge crowd in the front of the finishing line. People were waiting for the runners in their groups, or celebrating their finishing, or simply watching the runners crossing the finishing line. We met the last runner in our group at the finishing line, who brought us 4 medals for our 4 members in the group. There were letters on each medal separately, \"K\", \"Ö\", \"L\" and \"N\", which spells Köln, the German name of Cologne.",
        "zh": "我的同事们跑得都比我快多了，所以我们还没在第三个交接点等多久，我们组的第三个跑者就到了。交接完之后，我们都向着终点线的方向走去。终点线前可以说是人山人海。有些人在等他们组的跑者，有些人在庆祝，有些人完全是来凑热闹的，看着一个个跑者们跑过终点线。我们在终点线那里遇到了我们组的最后一个跑者，他给我们带了四块奖牌，四个跑者一人一块。四块奖牌上各有一个字母：“K”、“Ö”、“L”和“N”，拼起来就是Köln——科隆的德文名字。"
      }
    },
    {
      "type": "ImageBlock",
      "url": "/images/2022-10-02--cologne-marathon-medal.jpg",
      "description": {
        "en": "The wooden medal of Cologne Marathon relay",
        "zh": "科隆马拉松接力跑的木制奖牌"
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "Later, I went for a late lunch with my colleagues. We had a good time chatting while enjoying the Indian food. After the lunch, we were heading home separatedly. But I just thought, I had seldomly visited Cologne since I moved to Nordrhein-Westfalen. So I decided to do a city-tour alone before I drove home. Because I was going \"minimalistic\" for the Marathon relay today, I didn't take the camera with me, but a smartphone camera would be OK I guess.",
        "zh": "后来，我和我的同事去吃了一顿迟到的午饭。我们一边吃着印度菜，一边相谈甚欢。午饭过后，大家就各自回各自的家了。不过我想，自从我到了北莱茵—威斯特法伦州之后，我还没怎么在科隆转过呢。所以我决定在开车回家之前自己一个人在科隆走一圈。因为我今天要跑马拉松接力，所以我走的是“极简主义路线”，我身上没带什么东西，当然我的相机也不例外。不过用手机拍一下照片应该也是大概够用的吧我想。"
      }
    },
    {
      "type": "ImageBlock",
      "url": "/images/2022-10-02--buildings-along-the-street.jpg",
      "description": {
        "en": "Buildings along the street",
        "zh": "街边的建筑物"
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "I already heard quite a lot about Cologne from other people before. They were talking about the friendly and open people, talking about the carnaval and talking about the unique local beer. But the one sentence that describes Cologne the best that I have ever heard would be \"Cologne is probably not a beautiful city, but it is definitely a lively one.\" I totally agree with this.",
        "zh": "我在此之前已经听过很多不同的人谈起过科隆了。他们说起过科隆的人是多么的友好、开放，还说起科隆的狂欢节，还有这里独特的本地啤酒。不过我个人觉得我听到过的，描述科隆这座城市最恰当的句子恐怕是：“科隆或许算不上一座漂亮的城市，但是它绝对是一座充满生机的城市。”这一点我是无比赞同的。"
      }
    },
    {
      "type": "ImageBlock",
      "url": "/images/2022-10-02--scupture-and-fountain.jpg",
      "description": {
        "en": "Scupture and Fountain",
        "zh": "雕塑与喷泉"
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "In my opinion, the liveliness of Cologne comes from its complexity and diversity. Different styles, different times, different thoughts and different people are all being mixed here. That's my impression of Cologne while I was doing my first city tour on my own.",
        "zh": "我觉得科隆的生机勃勃是来自于它的复杂性与多样性。不同的风格、不同的时代、不同的思想和不同的人，都在这座城市里被混在了一起。这就是我在自己一个人游览的时候，科隆给我留下的第一印象。"
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "I walked from Aachener Street to the east, all the way down to the Cathedral, and then crossed the Rhein through Hohenzollern Bridge, and finally reached Deutz. Here, everything are mixed together, the old, the new and also the future. It is very common to see modern buildings beside the old buildings, and the crane lifts, skyscrapers and the Cathedral are on the horizon. There are all glasses and concrete walls along one street, after a turn, there are red bricks and old scuptures. There are a lot of row houses in mixed style, which emphasises the \"mixed-style\" here - an old building would be sandwiched by two modern buildings, and the opposite side of the street there is a small construction site.",
        "zh": "我从亚琛街开始一直往东走，一直走到了大教堂，然后再从霍亨佐伦桥跨过莱茵河，最后一直走到多伊茨。在这里，不管是老的、新的，还是未来的东西，它们都像是被混在了一起一样。一栋现代建筑物矗立在一栋老房子旁边，地平线上有塔吊、摩天大楼和大教堂，这样的景象在这里再正常不过了。走在一条街上的时候，看见的还都是玻璃和混凝土墙，转过一个弯角就全是红砖和上了年纪的雕塑。有好多排房也是混合式的风格，这更加强了这种“混在一起”的感官刺激——一栋老房子可能就像是三明治一样被夹在两栋现代化的建筑物中间，然后对面的街边就是一个小工地。不仅是建筑物，文化也如是。在这里，你可以看到各种各样的人，操着各种各样的语言，做着各种各样的事情。虽然在汉堡和柏林也有类似的经历，但是科隆不像汉堡那么现代化，也不像柏林有一种冷冰冰的残破感和机械感，科隆给人的感觉是暖色调的，是有人性的。"
      }
    },
    {
      "type": "ImageBlock",
      "url": "/images/2022-10-02--cologne-city-house.jpg",
      "description": {
        "en": "Modern building in Cologne",
        "zh": "科隆市区里的现代化建筑物"
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "Not only the buildings, the cultures too. Here you could meet different people in different skin tones, talking in different languages, doing different things. Although I had the similar experiences in Hamburg and Berlin, but Cologne is not as modern as Hamburg, and ist not as cold, broken and mechanical like Berlin. Cologne has a warm feeling, it is humanlike, it is just like saying I'm a hipster without saying \"I'm a hipster\".",
        "zh": "不仅是建筑物，文化也如是。在这里，你可以看到各种各样不同肤色的人，操着各种各样的语言，做着各种各样的事情。虽然我在汉堡和柏林也有类似的经历，但是科隆不像汉堡那么现代化，也不像柏林有一种冷冰冰的残破感和机械感。科隆给人的感觉是暖色调的，是有人性的，像是在说我是嬉皮士，但是只字不提“我是嬉皮士”一样。"
      }
    },
    {
      "type": "ImageBlock",
      "url": "/images/2022-10-02--cologne-cathedral.jpg",
      "description": {
        "en": "Cologne Cathedral",
        "zh": "科隆主教座堂"
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "I like Cologne Cathedral very much, which is also one of the few parts of Cologne that I've already visited. Several years ago, I did a bicycle tour all the way from Karlsruhe to Cologne. After I had visited the Cologne Cathedral, I wrote a line like this, \"although I'm not a christian, I totally understand why people would believe in God. Just thinking about it, what kind of power could it be behind the construction of those catholic churches, so that people carried it on for more than hundreds of years, stikcing to the original design and finally finishing the master piece of architecture.\" All those pillars are carved so straight and smooth, and each of the scuptrues on the arches looks unique, not mentioning the twin towers are high up reaching the sky.",
        "zh": "我非常喜欢科隆大教堂，它也是科隆市区里我造访过的为数不多的几个地方。几年之前，我做过一次长途自行车旅行，一直从卡尔斯鲁厄骑车骑到了科隆。我看到了科隆大教堂之后，回去就写下了这么一句话，“虽然我不是什么天主教徒或者是基督徒，但是我完全可以理解为什么人们会信上帝。试想，建造这些教堂的背后到底是一种什么样的力量？它能让人们能几百年一直坚持下来，忠于最原始的设计，最后一直到整个建筑史上的巨作完工的那一刻。”所有的石柱都雕刻得笔直光滑，门拱上的雕塑每一个看上去都姿态各异，更别说那两座直插云霄的尖塔了。"
      }
    },
    {
      "type": "ImageBlock",
      "url": "/images/2022-10-02--cologne-cathedral-arch.jpg",
      "description": {
        "en": "The scuptures in the arch of the main entrance of the Cathedral",
        "zh": "教堂主入口大门上方的门拱石雕"
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "Several months before, it was the second time that I've visited Cologne Cathedral. I was climbing one of the two towers with my colleague. From there you could see almost the whole city. And those little carved windows in the tip of the tower looks so lightweight, despite the fact that they were made of stone. The sun shines through those little windows into the tower, rendering the walls in a golden color.",
        "zh": "几个月之前，我第二次参观了科隆大教堂。那一次是跟我的一个同事一起，我们爬到了教堂双塔其中一个的塔顶。从那里几乎可以把整个城市尽收眼底。那些塔尖上雕刻的小石窗看起来是那么的轻盈，仿佛会让人忘掉它们还是用石头做的。阳光通过那些小石窗照进塔里，把墙壁渲染成金色。"
      }
    },
    {
      "type": "ImageBlock",
      "url": "/images/2022-10-02--cologne-cathedral-tower.jpg",
      "description": {
        "en": "Carved windows in the tip of one of the Cathedral towers",
        "zh": "教堂双塔其中一个的塔尖上的雕刻石窗"
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "But today, I was just passing by without staying at the Cathedral for a long time. Instead, I stayed on the Hohenzollern Bridge for quite a while. While running Marathon, the weather was still cloudy, but it turns to be sunny in the afternoon. The water in Rhein flowed slowly in the sunshine, which calms me down.",
        "zh": "不过，今天我只是匆匆地从教堂边走过，并没有在教堂那里做太多的停留。我在霍亨佐伦桥上倒是呆了好久。跑马拉松的时候天气还有些阴沉，而到了午后时分，天空放晴了。晴空下的莱茵河水缓缓地流淌着，给人一种非常平静的感觉。"
      }
    },
    {
      "type": "ImageBlock",
      "url": "/images/2022-10-02--rhein-riverbank.jpg",
      "description": {
        "en": "Rhein riverbank",
        "zh": "莱茵河畔"
      }
    },
    {
      "type": "ParagraphBlock",
      "content": {
        "en": "Standing in the breeze on the Rhein river, I was thinking that I had made the right decision to attend the Marathon relay. I could still remeber how it felt after I had run 10.8 km while training. I couldn't even believe that I had just run that long. It was a feeling of fulfillment and surpassing myself that I had missed too long. I'll probably do it again in the next year. Maybe next time, I can run the whole stage with an average speed under 6 minutes per kilometer",
        "zh": "站在莱茵河上的清风中，我在想，我当初决定报名参加马拉松接力真的是一个正确的决定。我还能清楚地记得当时在训练的时候，我跑下来10.8公里时候的感受。我当时都不敢相信我能跑下来整整10.8公里。那是一种久违的成就感与超越自我的感觉。或许明年我会考虑再参加一次这样的比赛吧。或许下一次，我就能用每公里低于6分钟的速度跑完全程了呢。"
      }
    }
  ]
}