{
  "items": [
    {
      "title": {
        "en": "Bergischer Short Hiking Trails #1 — Cloth-Maker Road",
        "zh": "贝吉舍短途徒步路线之一——纺织工之路"
      },
      "date": "2022-11-05",
      "thumbnailImageUrl": "https://live.staticflickr.com/65535/52484858399_e0e8b27c91_k_d.jpg",
      "excerpt": {
        "en": "I found a set of short-distance hiking trails in Bergisches Land, which are called \"Bergische Streifzüge\" in German. There are 24 of them in total, each of them is about 5 to 15 km long, and each of them has a different theme, which are perfect for weekend trips. I'd like to do them all one by one, and this time, I'd finish the first trail.",
        "zh": "我找到了一组贝吉舍斯兰的短途徒步路线，德语叫做“Bergische Streifzüge”。这组路线总共有24条，每一条路线的长度大概都在5到15公里之间，而且每一条路线都有一个特定的主题。这样的路线非常适合周末旅行。我想要把它们一条一条地都走下来。而这次，我计划完成第一条路线。"
      },
      "itemUrl": {
        "pageName": "article",
        "queries": {
          "articleConfigPath": "/articles/article-2022-11-05.json"
        }
      }
    },
    {
      "title": {
        "en": "\"Cave 114.84\" and the New Album Project",
        "zh": "《Cave 114.84》与新的专辑工程"
      },
      "date": "2022-11-03",
      "thumbnailImageUrl": "/images/2022-11-03--album-cover.jpg",
      "excerpt": {
        "en": "After I had visited the Museum of Applied Art Cologne, I went down along different streets randomly. At last I've stopped at an avenue in the campus of University of Cologne, there I sat down on a bench for a rest. After a while, a man came and started to play guitar. I like his style very much, thus I approached him and started to talk with him. Later I subscribbed his channle on YouTube. Few days ago, he published a new piece of remix work in his channel, which inspired me a lot. So I tried to remix his remix, and the result was amazingly good to me.",
        "zh": "我参观了科隆应用艺术博物馆，之后我就一直沿着大街小巷漫无目的地随便走。最后我在科隆大学校区里的一条林荫大道旁停了下来，坐在长椅上歇脚。过了一会儿，一个人在我的旁边弹起吉他来。我还挺喜欢他弹的风格的，于是就上前去搭讪。后来我在YouTube上面订阅了他的频道。前几天，他发了一个新的remix作品，这让我突然有了灵感。于是我remix了他的remix，结果出其不意地让我感觉非常好。"
      },
      "itemUrl": {
        "pageName": "article",
        "queries": {
          "articleConfigPath": "/articles/article-2022-11-03.json"
        }
      }
    },
    {
      "title": {
        "en": "Continental Typewriter Repaired",
        "zh": "修理好的Continental打字机"
      },
      "date": "2022-10-18",
      "thumbnailImageUrl": "/images/2022-10-18--typewriter-repaired.jpg",
      "excerpt": {
        "en": "The village where I'm living had organized a flea market at the end of the September. A lot of people were selling their stuff that were covered by the thickest layer of dirt. I picked up two things after a whole morning of eye-shopping. One of them was an old laptop bag, and the other one was this quite old but yet tasteful-looking typewriter.",
        "zh": "9月末的时候，村子里组织了一个跳蚤市场，好多人都拿着家里吃灰最多的东西出来卖。转了一上午之后，我挑了两个让我觉得很满意的东西。一个是看起来稍微有点旧的电脑包，另一个就是这台看起来相当古旧，又非常有味道的打字机。"
      },
      "itemUrl": {
        "pageName": "article",
        "queries": {
          "articleConfigPath": "/articles/article-2022-10-18.json"
        }
      }
    },
    {
      "title": {
        "en": "Marathon Run & First Impressions of Cologne",
        "zh": "马拉松接力跑与科隆的第一印象"
      },
      "date": "2022-10-02",
      "thumbnailImageUrl": "/images/2022-10-02--cologne-marathon-medal.jpg",
      "excerpt": {
        "en": "This is my very first time taking part in a marathon relay, and this is also my very first time running 11.5 km. Speed is not important anymore. I've finished my stage, that's the most important part.",
        "zh": "这是我第一次参加马拉松接力跑，也是我第一次跑下来11.5公里。速度完全不重要，重要的是我把我的那一段跑下来了。"
      },
      "itemUrl": {
        "pageName": "article",
        "queries": {
          "articleConfigPath": "/articles/article-2022-10-02.json"
        }
      }
    },
    {
      "title": {
        "en": "BMW 316ti Compact Project Reaches a Milestone",
        "zh": "BMW 316ti Compact工程暂时告一段落"
      },
      "date": "2022-09-17",
      "thumbnailImageUrl": "/images/2022-09-17--finished-interior-2.jpg",
      "excerpt": {
        "en": "After almost a whole month of lazy work, the BMW 316ti Project has reached a milestone",
        "zh": "BMW 316ti Compact工程懒懒散散地搞了有将近一个月，现在总算是告一段落了。"
      },
      "itemUrl": {
        "pageName": "article",
        "queries": {
          "articleConfigPath": "/articles/article-2022-09-17.json"
        }
      }
    }
  ]
}