{
  "items": [
    {
      "title": {
        "en": "New Radio and Interior Trims of BMW 316ti Compact",
        "zh": "BMW 316ti Compact的新音响和内饰饰条"
      },
      "date": "2022-09-11",
      "thumbnailImageUrl": "/images/2022-09-11--painted-interior-trim-2.jpg",
      "excerpt": {
        "en": "I've changed the head unit and the speaker of the audio system, and also painted the interior trim of the car. The only thing left is to repair some mount points on the back side of the door panel. Now the car looks much better than at the time when I bought it, which makes me very happy. What should I do in the next step? Let's see!",
        "zh": "我给车子换掉了音响头、换了扬声器，还把车子里的内饰饰条重新喷了漆。现在就只剩下门板背后的一些固定点还需要修理。车子现在看上去比我刚刚买它的时候还要新了，这让我很是高兴。下一步我会给车子做哪些改动呢？走一步瞧一步吧！"
      },
      "itemUrl": {
        "pageName": "article",
        "queries": {
          "articleConfigPath": "/articles/article-2022-09-11.json"
        }
      }
    },
    {
      "title": {
        "en": "Neyetalsperre in the Sunshine and the Castle on the Water",
        "zh": "烈日下的Neyetalsperre与水中城堡"
      },
      "date": "2022-07-16",
      "thumbnailImageUrl": "https://live.staticflickr.com/65535/52229071737_9c734fb244_k_d.jpg",
      "excerpt": {
        "en": "After 3 days of hard work in the garden, now it is the perfect time for a short trip. I went back to Neyetalsperre first, and then visited Burgruine Eibach. Two things I've learnt this time. First, taking pictures in the bright sunshine can be a challenging task. Second, Darktable is really powerful!",
        "zh": "在花园里忙活了三天之后，现在正是出去游玩的好机会。我先是回去Neyetalsperre看了看，然后又去了Burgruine Eibach。这次我学到两件事情：第一，在晴朗的天气拍照也有可能是一件相当有挑战的事情；第二，Darktable真是太强大了！"
      },
      "itemUrl": {
        "pageName": "article",
        "queries": {
          "articleConfigPath": "/articles/article-2022-07-16.json"
        }
      }
    },
    {
      "title": {
        "en": "A Short Walk near Federath",
        "zh": "在Federath周围散步"
      },
      "date": "2022-07-02",
      "thumbnailImageUrl": "https://live.staticflickr.com/65535/52189585677_8f0386d8f5_c_d.jpg",
      "excerpt": {
        "en": "Since I had started taking pictures with my camera, I noticed that I'm addicted to it. Whenever I'm free, I'll be thinking whether I should go out and take some pictures. Today is Saturday, the weather is clear, it is the perfect time for outdoor. I drove to Federath, and walked along the road on the hills for the whole afternoon.",
        "zh": "自从开始用相机拍照片之后，我发现我好像有点上瘾了。每天闲下来的时候我就会想着要出去走一走，拍两张照片回来。今天是周六，天气非常好，正好是出行的好机会，所以我就开车去了Federath，沿着丘陵上的小路慢慢地像散步一样走了一下午。"
      },
      "itemUrl": {
        "pageName": "article",
        "queries": {
          "articleConfigPath": "/articles/article-2022-07-02.json"
        }
      }
    }
  ]
}